Network Working Group                          Greg Sidebottom (Editor)
INTERNET-DRAFT                                             Guy Mousseau
                                                        Nortel Networks
                                                             Lyndon Ong
                                                   Point Reyes Networks
                                                             Ian Rytina
                                                               Ericsson
                                             Hanns-Juergen Schwarzbauer
                                                      Klaus Gradischnig
                                                                Siemens
                                                          Ken Morneault
                                                                  Cisco
                                                          Mallesh Kalla
                                                              Telcordia
                                                         Normand Glaude
                                               Performance Technologies


Expires in six months                                         Feb 2001



                SS7 MTP3-User Adaptation Layer (M3UA)
                  <draft-ietf-sigtran-m3ua-06.txt>


Status of This Memo

This document is an Internet-Draft and is in full conformance with all 
provisions of Section 10 of RFC 2026. Internet-Drafts are working 
documents of the Internet Engineering Task Force (IETF), its areas, and 
its working groups.  Note that other groups may also distribute working 
documents as Internet-Drafts.

Internet-Drafts are draft documents valid for a maximum of six months 
and may be updated, replaced, or obsoleted by other documents at any 
time.  It is inappropriate to use Internet-Drafts as reference material 
or to cite them other than as 'work in progress.'

     The list of current Internet-Drafts can be accessed at
     http://www.ietf.org/ietf/1id-abstracts.txt

     The list of Internet-Draft Shadow Directories can be accessed at
     http://www.ietf.org/shadow.html.


To learn the current status of any Internet-Draft, please check the 
'1id-abstracts.txt' listing contained in the Internet- Drafts Shadow 
Directories on ftp.is.co.za (Africa), nic.nordu.net (Europe), 
munnari.oz.au (Pacific Rim), ftp.ietf.org (US East Coast), or 
ftp.isi.edu (US West Coast).



Abstract

This Internet Draft defines a protocol for supporting the transport of 
any SS7 MTP3-User signalling (e.g., ISUP and SCCP messages) over IP 
using the services of the Stream Control Transmission Protocol.  Also, 
provision is made for protocol elements that enable a seamless 
operation of the MTP3-User peers in the SS7 and IP domains. This 


Sidebottom et al                                              [Page 1]

Internet Draft         SS7 MTP3-User Adaptation Layer         Feb 2001

protocol would be used between a Signalling Gateway (SG) and a Media 
Gateway Controller (MGC) or IP-resident Database.  It is assumed that 
the SG receives SS7 signalling over a standard SS7 interface using the 
SS7 Message Transfer Part (MTP) to provide transport. 

















































Sidebottom et al                                              [Page 2]

Internet Draft         SS7 MTP3-User Adaptation Layer         Feb 2001


                        TABLE OF CONTENTS

1. Introduction.......................................................4
    1.1 Scope.........................................................4
    1.2 Terminology...................................................4
    1.3 M3UA Overview.................................................6
    1.4 Functional Areas.............................................12
    1.5 Sample Configurations........................................23
    1.6 Definition of M3UA Boundaries................................26
2. Conventions.......................................................29
3. M3UA Protocol Elements............................................29
    3.1 Common Message Header........................................29
    3.2 Variable-Length Parameter....................................32
    3.3 Transfer Messages............................................33 
    3.4 SS7 Signalling Network management (SSNM) Messages............36
    3.5 Application Server Process Maintenance (ASPM) Messages.......44
    3.6 Management Messages..........................................60
4. Procedures........................................................63
    4.1 Procedures to Support the Services of the M3UA Layer.........63
    4.2 Receipt of M3UA Peer Management Messages.....................65
    4.3 Procedures to support the M3UA Management services...........66
    4.4 Procedures to Support the M3UA Services......................78 
5. Examples of M3UA Procedures.......................................81
    5.1 Establishment of Association and Traffic 
        Between SGs and ASPs.........................................81
    5.2 ASP traffic Fail-over Examples...............................86
    5.3 M3UA/MTP3-User Boundary Examples.............................87
6. Security..........................................................91
    6.1 Introduction.................................................91
    6.2 Threats......................................................91
    6.3 Protecting Confidentiality...................................91
7. IANA Considerations...............................................92
    7.1 SCTP Payload Protocol Identifier.............................92
    7.2 M3UA Protocol Extensions.....................................92
8. Acknowledgements..................................................93
9. References........................................................93
10. Author's Addresses...............................................95















Sidebottom et al                                              [Page 3]

Internet Draft         SS7 MTP3-User Adaptation Layer         Feb 2001


1.  Introduction

1.1 Scope

There is a need for Switched Circuit Network (SCN) signalling protocol 
delivery from an SS7 Signalling Gateway (SG) to a Media Gateway 
Controller (MGC) or IP-resident Database as described in the Framework 
Architecture for Signalling Transport [1].  The delivery mechanism 
SHOULD meet the following criteria: 

*  Support for the transfer of all SS7 MTP3-User Part messages (e.g., 
   ISUP, SCCP, TUP, etc.)
*  Support for the seamless operation of MTP3-User protocol peers
*  Support for the management of SCTP transport associations and 
   traffic between an SG and one or more MGCs or IP-resident Databases 
*  Support for MGC or IP-resident Database process fail-over and load-
   sharing
*  Support for the asynchronous reporting of status changes to 
   management 

In simplistic transport terms, the SG will terminate SS7 MTP2 and MTP3 
protocol layers and deliver ISUP, SCCP and/or any other MTP3-User 
protocol messages, as well as certain MTP network management events, 
over SCTP transport associations to MTP3-User peers in MGCs or IP-
resident Databases.


1.2 Terminology

Application Server (AS) - A logical entity serving a specific Routing 
Key. An example of an Application Server is a virtual switch element 
handling all call processing for a unique range of PSTN trunks, 
identified by an SS7 DPC/OPC/CIC_range.  Another example is a virtual 
database element, handling all HLR transactions for a particular SS7 
DPC/OPC/SCCP_SSN combination.  The AS contains a set of one or more 
unique Application Server Processes, of which one or more is normally 
actively processing traffic.

Application Server Process (ASP) - A process instance of an Application 
Server. An Application Server Process serves as an active or standby 
process of an Application Server (e.g., part of a distributed virtual 
switch or database). Examples of ASPs are processes (or process 
instances) of MGCs, IP SCPs or IP HLRs.  An ASP contains an SCTP end- 
point and may be configured to process signalling traffic within more 
than one Application Server. 

Association - An association refers to an SCTP association.  The 
association provides the transport for the delivery of MTP3-User 
protocol data units and M3UA adaptation layer peer messages.
 


Sidebottom et al                                              [Page 4]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


IP Server Process (IPSP) - A process instance of an IP-based 
application.  An IPSP is essentially the same as an ASP, except that it
uses M3UA in a point-to-point fashion.  Conceptually, an IPSP does not 
use the services of a Signalling Gateway.

Signalling Gateway Process (SGP) - A process instance of a Signalling 
Gateway.  It serves as an active, standby or load-sharing process of a 
Signalling Gateway.

Signalling Process - A process instance that uses M3UA to communicate 
with other signalling process.  An ASP, a signalling gateway process 
and an IPSP are all signalling processes.

Routing Key: A Routing Key describes a set of SS7 parameters and 
parameter values that uniquely define the range of signalling traffic 
to be handled by a particular Application Server. Parameters within the 
Routing Key cannot extend across more than a single SS7 Destination 
Point Code.

Routing Context - A value that uniquely identifies a Routing Key.
Routing Context values are either configured using a configuration 
management interface, or by using the routing key management procedures 
defined in this document.

Fail-over - The capability to re-route signalling traffic as required 
to an alternate Application Server Process, or group of ASPs, within an 
Application Server in the event of failure or unavailability of a 
currently used Application Server Process.  Fail-over also applies upon 
the return to service of a previously unavailable Application Server 
Process.

Signalling Point Management Cluster (SPMC) - The complete set of 
Application Servers represented to the SS7 network under one specific 
SS7 Point Code of one specific Network Appearance.  SPMCs are used to 
sum the availability / congestion / User_Part status of an SS7 
destination point code that is distributed in the IP domain, for the 
purpose of supporting MTP3 management procedures at an SG.  In some 
cases, the SG itself may also be a member of the SPMC.  In this case, 
the SG availability / congestion / User_Part status must also be taken 
into account when considering any supporting MTP3 management actions.  

MTP - The Message Transfer Part of the SS7 protocol.

MTP3 - MTP Level 3, the signalling network layer of SS7

MTP3-User - Any protocol normally using the services of the SS7 MTP3 
(e.g., ISUP, SCCP, TUP, etc.).

Network Appearance - The Network Appearance identifies an SS7 network 
context for the purposes of logically separating the signalling traffic 


Sidebottom et al                                              [Page 5]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001

between the SG and the Application Server Processes over a common SCTP
Association.  An example is where an SG is logically partitioned to 
appear as an element in four separate national SS7 networks.  A Network 
Appearance implicitly defines the SS7 Point Code(s), Network Indicator 
and MTP3 protocol type/variant/version used within a specific SS7 
network partition.  A physical SS7 route-set or link-set at an SG can 
appear in only one network appearance. The Network Appearance is not 
globally significant and requires coordination only between the SG and 
the ASP. Therefore, in the case where an ASP is connected to more than 
one SG, the same SS7 network context may be identified by different 
Network Appearances depending over which SG a message is being 
transmitted/received.

Network Byte Order: Most significant byte first, a.k.a Big Endian.

Layer Management - Layer Management is a nodal function that handles 
the inputs and outputs between the M3UA layer and a local management 
entity.  

Host - The computing platform that the ASP process is running on.

Stream - A stream refers to an SCTP stream; a uni-directional logical 
channel established from one SCTP endpoint to another associated SCTP 
endpoint, within which all user messages are delivered in-sequence 
except for those submitted to the un-ordered delivery service.


1.3 M3UA Overview

1.3.1 Protocol Architecture.  

The framework architecture that has been defined for SCN signalling 
transport over IP [1] uses multiple components, including a common 
signalling transport protocol and an adaptation module to support the 
services expected by a particular SCN signalling protocol from its 
underlying protocol layer.  

Within the framework architecture, this document defines an MTP3-User 
adaptation module suitable for supporting the transfer of messages of 
any protocol layer that is identified to the MTP Level 3 layer, in SS7 
terms, as a user part.  The list of these protocol layers include, but 
is not limited to, ISDN User Part (ISUP) [2,3,4], Signalling Connection 
Control Part (SCCP) [5,6,7] and Telephone User Part (TUP) [8].  TCAP 
[9,10,11] or RANAP [12] messages are transferred transparently by the 
M3UA as SCCP payload, as they are SCCP-User protocols.  

It is recommended that the M3UA use the services of the Stream Control 
Transmission Protocol (SCTP) [13] as the underlying reliable common 
signalling transport protocol. This is to take advantage of various 
SCTP features such as:



Sidebottom et al                                              [Page 6]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


   - Explicit packet-oriented delivery (not stream-oriented);
   - Sequenced delivery of user messages within multiple streams,
     with an option for order-of-arrival delivery of individual
     user messages, 
   - Optional multiplexing of user messages into SCTP datagrams; 
   - Network-level fault tolerance through support of multi-homing
     at either or both ends of an association;
   - Resistance to flooding and masquerade attacks; and   
   - Data segmentation to conform to discovered path MTU size. 

Under certain scenarios, such as back-to-back connections without 
redundancy requirements, the SCTP functions above MAY NOT be a 
requirement and TCP can be used as the underlying common transport 
protocol.  

1.3.2 Services Provided by the M3UA Layer

The M3UA Layer at an ASP or IPSP provides the equivalent set of 
primitives at its upper layer to the MTP3-Users as provided by the MTP 
Level 3 to its local MTP3-Users at an SS7 SEP.  In this way, the ISUP 
and/or SCCP layer at an ASP or IPSP is unaware that the expected MTP3 
services are offered remotely from an MTP3 Layer at an SG, and not by a 
local MTP3 layer.  The MTP3 layer at an SG may also be unaware that its 
local users are actually remote user parts over M3UA.  In effect, the 
M3UA extends access to the MTP3 layer services to a remote IP-based 
application.  The M3UA does not itself provide the MTP3 services.  
However, in the case where an ASP is connected to more than one SG, the 
M3UA Layer at an ASP must maintain the status of configured SS7 
destinations and route messages according to the availability / 
congestion status of the routes to these destinations via each SG.

The M3UA Layer may also be used for point-to-point signalling between 
two IP Server Processes (IPSPs).  In this case, the M3UA provides the 
same set of primitives and services at its upper layer as the MTP3. 
However, in this case the expected MTP3 services are not offered 
remotely from an SG.  The MTP3 services are provided but the procedures 
to support these services are a subset of the MTP3 procedures due to 
the simplified point-to-point nature of the IPSP to IPSP relationship.

1.3.2.1 Support for the transport of MTP3-User Messages

The M3UA provides the transport of MTP-TRANSFER primitives across an 
established SCTP association between an SG and an ASP or between IPSPs.

The MTP-TRANSFER primitive information is encoded as in MTP3-User 
messages.  In this way, the SCCP and ISUP messages received from the 
SS7 network by the SG are not re-encoded into a different format for 
transport between the M3UA peers.  The MTP3 Service Information Octet 
(SIO) and Routing Label (OPC, DPC, and SLS) are included, encoded as 
expected by the MTP3 and MTP3-User protocol layer. 


Sidebottom et al                                             [Page 7]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


At an ASP, in the case where a destination is reachable via multiple 
SGs, the M3UA must also choose via which SG the message is to be routed 
or support load balancing across the SGs, ensuring that no mis-
sequencing occurs.

The M3UA does not impose a 272-octet signaling information field (SIF) 
length limit as specified by the SS7 MTP Level 2 protocol [14] [15] 
[16].  Larger information blocks can be accommodated directly by 
M3UA/SCTP, without the need for an upper layer segmentation/re-assembly 
procedure as specified in recent SCCP or ISUP versions.  However, in 
the context of an SG, the maximum 272-octet block size must be followed 
when inter-working to a SS7 network that does not support the transfer 
of larger information blocks to the final destination.  This avoids 
potential ISUP or SCCP fragmentation requirements at the SG.  However, 
if the SS7 network is provisioned to support the Broadband MTP [20] to 
the final SS7 destination, the information block size limit may be 
increased past 272 octets.  

1.3.2.2 Native Management Functions

The M3UA provides management of the underlying SCTP transport protocol 
to ensure that SG-ASP and IPSP-IPSP transport is available to the 
degree called for by the MTP3-User signalling applications.

The M3UA provides the capability to indicate errors associated with 
received M3UA messages and to notify, as appropriate, local management 
and/or the peer M3UA.

1.3.2.3 Inter-working with MTP3 Network Management Functions

At the SG, the M3UA must also provide inter-working with MTP3 
management functions to support seamless operation of the user SCN 
signalling applications in the SS7 and IP domains.  This includes:
 
  - Providing an indication to MTP3-Users at an ASP that a remote 
    destination in the SS7 network is not reachable.

  - Providing an indication to MTP3-Users at an ASP that a remote 
    destination in the SS7 network is now reachable.

  - Providing an indication to MTP3-Users at an ASP that messages to a 
    remote MTP3-User peer in the SS7 network are experiencing SS7 
    congestion.

  - Providing an indication to MTP3-Users at an ASP that the routes to 
    a remote MTP3-User peer in the SS7 network are restricted.

  - Providing an indication to MTP3-Users at an ASP that a remote MTP3-
    User peer is unavailable.  



Sidebottom et al                                             [Page 8]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


The M3UA layer at an ASP may initiate an audit of the availability, the 
restricted or the congested state of remote SS7 destinations.  This 
information is requested from the M3UA at the SG. 

The M3UA layer at an ASP may also indicate to the SG that the M3UA 
itself or the ASP or the ASP's Host is congested.

1.3.2.4 Support for the management of SCTP associations between the SG 
and ASPs.

The M3UA layer at the SG maintains the availability state of all 
configured remote ASPs, in order to manage the SCTP Associations and 
the traffic between the M3UA peers.  As well, the active/inactive and 
congestion state of remote ASPs is maintained.

The M3UA layer MAY be instructed by local management to establish an 
SCTP association to a peer M3UA node.  This can be achieved using the 
M-SCTP ESTABLISH primitive to request, indicate and confirm the 
establishment of an SCTP association with a peer M3UA node.  In order 
to avoid redundant SCTP associations between two M3UA peers, one side 
(client) must be designated to establish the SCTP association, or M3UA 
configuration knowledge maintained to detect redundant associations 
(e.g., via knowledge of the expected local and remote SCTP endpoint 
addresses).

The M3UA layer MAY also need to inform local management of the status 
of the underlying SCTP associations using the M-SCTP STATUS request and 
indication primitive. For example, the M3UA MAY inform local management 
of the reason for the release of an SCTP association, determined either 
locally within the M3UA layer or by a primitive from the SCTP.

Also the M3UA layer may need to inform the local management of the 
change in status of an ASP or AS.  This may be achieved using the M-ASP 
STATUS request or M-AS STATUS request primitives.

1.3.2.5 Support for the management of connections to multiple SGs

As shown in Figure 1 an ASP may be connected to multiple SGs. In such a 
case a particular SS7 destination may be reachable via more than SG, 
i.e., via more than one route. As MTP3 users only maintain status on a 
destination and not on a route basis, M3UA must maintain the status 
(availability, restriction, and/or congestion of route to destination) 
of the individual routes, derive the overall availability or congestion 
status of the destination from the status of the individual routes, and 
inform the MTP3 users of this derived status whenever it changes.

1.3.3 Signalling Network Architecture

A Signalling Gateway is used to support the transport of MTP3-User 
signalling traffic received from the SS7 network to multiple


Sidebottom et al                                              [Page 9]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


distributed ASPs (e.g., MGCs and IP Databases).  Clearly, the M3UA 
protocol is not designed to meet the performance and reliability 
requirements for such transport by itself.  However, the conjunction of 
distributed architecture and redundant networks does allow for a 
sufficiently reliable transport of signalling traffic over IP.  The 
M3UA protocol is flexible enough to allow its operation and management 
in a variety of physical configurations, enabling Network Operators to 
meet their performance and reliability requirements.  

To meet the stringent SS7 signalling reliability and performance 
requirements for carrier grade networks, Network Operators SHOULD 
ensure that no single point of failure is present in the end-to-end 
network architecture between an SS7 node and an IP-based application.  
This can typically be achieved through the use of redundant SGs, 
redundant hosts, and the provision of redundant QOS-bounded IP network 
paths for SCTP Associations between SCTP End Points. Obviously, the 
reliability of the SG, the MGC and other IP-based functional elements 
also needs to be taken into account.  The distribution of ASPs within 
the available Hosts must also be considered.  As an example, for a 
particular Application Server, the related ASPs should be distributed 
over at least two Hosts.

One example of a physical network architecture relevant to SS7 carrier-
grade operation in the IP network domain is shown in Figure 1 below:




























Sidebottom et al                                              [Page 10]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001

          SG                                     MGC

  Host#1 **************                          ************** Host#1
     =   *  ********__*__________________________*__********  *   =
    SG1  *  * SGP1 *__*_____      _______________*__* ASP1 *  *  MGC1
         *  ********  *     \    /               *  ********  *
         *  ********__*______\__/________________*__********  *
         *  * SGP2 *__*_______\/______      _____*__* ASP2 *  *
         *  ********  *       /\      |    |     *  ********  *
         *      :     *      /  \     |    |     *      :     *
         *  ********  *     /    \    |    |     *  ********  *
         *  * SGPn *  *     |    |    |    |     *  * ASPn *  *
         *  ********  *     |    |    |    |     *  ********  *
         **************     |    |    |    |     **************
                            |    |    \    /
  Host#2 **************     |    |     \  /      ************** Host#2
     =   *  ********__*_____|    |______\/_______*__********  *   =
    SG2  *  * SGP1 *__*_________________/\_______*__* ASP1 *  *  MGC2
         *  ********  *                /  \      *  ********  *
         *  ********__*_______________/    \_____*__********  *
         *  * SGP2 *__*__________________________*__* ASP2 *  *
         *  ********  *                          *  ********  *
         *      :     *     SCTP Associations    *      :     *
         *  ********  *                          *  ********  *
         *  * SGPn *  *                          *  * ASPn *  *
         *  ********  *                          *  ********  *
         **************                          **************

                      Figure 1 - Physical Model


In this model, each host has many application processes.  In the case 
of the MGC, an ASP may provide service to one or more application 
server, and is identified as an SCTP end point.  In the case of the SG, 
a pair of signalling gateway processes may represent, as an example, a 
single network appearance, serving a signalling point management 
cluster.

This example model can also be applied to IPSP-IPSP signalling.  In 
this case, each IPSP would have its services distributed across 2 hosts 
or more, and may have multiple server processes on each host.

In the example above, each signalling process (SGP, ASP or IPSP) is the 
end point to more than one SCTP association, leading to many other 
signalling processes.  To support this, a signalling process must be 
able to support distribution of M3UA messages to many simultaneous 
active associations.  This message distribution function is based on 
the status of provisioned routing keys, the availability of signalling 
points in the SS7 network, and the redundancy model (active-standby, 
load-sharing, n+k) of the remote signalling processes.



Sidebottom et al                                             [Page 11]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001

For carrier grade networks, the failure or isolation of a particular 
signalling process SHOULD NOT cause stable calls or transactions to be 
lost.  This implies that signalling processes need, in some cases, to 
share the call/transaction state or be able to pass the call state 
information between each other.  In the case of ASPs performing call 
processing, coordination may also be required with the related Media 
Gateway to transfer the MGC control for a particular trunk termination.  
However, this sharing or communication of call/transaction state 
information is outside the scope of this document.

This model serves as an example.  M3UA imposes no restrictions as to 
the exact layout of the network elements, the message distribution 
algorithms and the distribution of the signalling processes.  Instead, 
it provides a framework and a set of messages that allow for a flexible 
and scalable signalling network architecture, aiming to provide 
reliability and performance.


1.4 Functional Areas

1.4.1 Signalling Point Code Representation

Within an SS7 network, a Signalling Gateway is charged with 
representing a set of nodes in the IP domain into the SS7 network for 
routing purposes.  The SG itself, as a physical node in the SS7 
network, must be addressable with an SS7 Point Code for MTP3 Management 
purposes. The SG Point Code is also used for addressing any local MTP3-
Users at the SG such as an SG-resident SCCP function.  

An SG may be logically partitioned to operate in multiple SS7 network 
Appearances.  In such a case, the SG must be addressable with a Point 
Code in each network appearance, and represents a set of nodes in the 
IP domain into each SS7 network.  Alias Point Codes [15] may also be 
used within an SG network appearance. 

The M3UA places no restrictions on the SS7 Point Code representation of 
an AS.  Application Servers can be represented under the same Point 
Code of the SG, their own individual Point Codes or grouped with other 
Application Servers for Point Code preservation purposes.  A single 
Point Code may be used to represent the SG and all the Application 
Servers together, if desired. 

Where Application Servers are grouped under a Point Code address, an 
SPMC will include more than one AS. If full advantage of SS7 management 
procedures is to be taken (as is advisable in carrier grade networks) 
care must be taken that, if one AS of an SPMC becomes unavailable, all 
Application Servers of the SPMC become unavailable from the SG. 
Otherwise, usage of SS7 transfer prohibited procedures by the SG 
becomes problematic as either traffic to the unavailable AS cannot be 
stopped/diverted or traffic to a still available AS will be 
unnecessarily stopped/diverted. (Depending on the network configuration 


Sidebottom et al                                             [Page 12]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001

it may even be necessary to assign an individual SS7 point code to each 
AS.) 

Observing this principle is of particular importance if alternative 
routing possibilities exist on the SS7 level (e.g. via mated SGs) or 
application level (e.g. via another MGC/MG).

If an ASP or group of ASPs is available to the SS7 network via more 
than one SG, each with its own Point Code, the ASP(s) should be 
represented by a Point Code that is separate from any SG Point Code.  
This allows these SGs to be viewed from the SS7 network as "STPs", each 
having an ongoing  "route" to the same ASP(s).  Under failure 
conditions where the ASP(s) become(s) unavailable from one of the SGs, 
this approach enables MTP3 route management messaging between the SG 
and SS7 network, allowing simple SS7 re-routing through an alternate SG 
without changing the Destination Point Code Address of SS7 traffic to 
the ASP(s). 

Where an AS can be reached via more than one SG it is equally important 
that the corresponding Routing Keys in the involved SGs are identical.  
(Note: It is possible for the Routing Key configuration data to be 
temporarily out-of-synch during configuration updates).


                           +--------+ 
                           |        | 
              +------------+  SG 1  +--------------+ 
  +-------+   |  SS7 links | "STP"  |  IP network  |     ---- 
  |  SEP  +---+            +--------+              +---/      \ 
  |   or  |                                           |  ASPs  | 
  |  STP  +---+            +--------+              +---\      / 
  +-------+   |            |        |              |     ---- 
              +------------+  SG 2  +--------------+ 
                           | "STP"  | 
                           +--------+

Note: there is no SG-to-SG communication shown, so each SG can be 
reached only via the direct linkset from the SS7 network. 

The following example shows a signalling gateway partitioned into two 
network appearances.

                               SG
  +-------+              +---------------+
  |  SEP  +--------------| SS7 Ntwk |M3UA|              ----
  +-------+   SS7 links  |   "A"    |    |            /      \
                         |__________|    +-----------+  ASPs  |
                         |          |    |            \      /
  +-------+              | SS7 Ntwk |    |              ----
  |  SEP  +--------------+   "B"    |    |
  +-------+              +---------------+


Sidebottom et al                                             [Page 13]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


1.4.2 Routing Contexts and Routing Keys

1.4.2.1 Overview

The distribution of SS7 messages between the SG and the Application 
Servers is determined by the Routing Keys and their associated Routing 
Contexts. A Routing Key is essentially a set of SS7 parameters used to 
filter SS7 messages, whereas the Routing Context parameter is a 4-byte 
value (integer) that is associated to that Routing Key in a 1:1 
relationship. The Routing Context therefore can be viewed as an index 
into a sending node's Message Distribution Table containing the Routing 
Key entries.

Possible SS7 address/routing information that comprise a Routing Key 
entry includes, for example, the OPC, DPC, SIO found in the MTP3 
routing label, or other MTP3-User specific fields such as the ISUP CIC, 
SCCP subsystem number, or TCAP transaction ID.  Some example Routing 
Keys are: the DPC alone, the DPC/OPC combination, the DPC/OPC/CIC 
combination, or the DPC/SSN combination.  The particular information 
used to define an M3UA Routing Key is application and network 
dependent, and none of the above examples are mandated.  

An Application Server Process may be configured to process signalling 
traffic related to more than one Application Server, over a single SCTP 
Association.  In ASP Active and Inactive management messages, the 
signalling traffic to be started or stopped is discriminated by the 
Routing Context parameter.  At an ASP, the Routing Context parameter 
uniquely identifies the range of signalling traffic associated with 
each Application Server that the ASP is
configured to receive.

1.4.2.2 Routing Key Limitiations

>From an SS7 network perspective, a Routing Key is limited to within a 
single SS7 Destination Point Code. This is important, as the SG must be 
able to present this point code to the SS7 network, without 
compromising the integrity of the Signaling Point Management Cluster.

Some SS7 networks may require the SG to generate UPU messages in
failure conditions. In this case, the AS and SG may optionally limit a
Routing Key to a single Service Indicator (ISUP, TUP, SCCP, etc.).  The 
SG generation of a UPU message into the SS7 network is implementation 
dependent, therefore no specific procedures are outlined in this 
document.

Routing Keys MUST be unique in the sense that a received SS7 signalling
message cannot be matched to more than one Routing Key. It is not
necessary for the parameter range values within a particular Routing 
Key to be contiguous.  For example, an AS could be configured to 



Sidebottom et al                                             [Page 14]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


support call processing for multiple ranges of PSTN trunks that are not
represented by contiguous CIC values. 

1.4.2.3 Managing Routing Contexts and Routing Keys

There are two ways to ways to provision a Routing Key at an SG. A 
Routing Key may be configured using an implementation dependent 
management interface, statically or dynamically in full accordance to 
the M3UA specifications. A Routing Key may also be configured using the 
M3UA dynamic registration/deregistration procedures defined in this 
document.  An M3UA element must implement at least one method of 
Routing Key provisioning.

When using a management interface to configure Routing Keys, the 
message distribution function within the SG is not limited to the set 
of parameters defined in this document.  Other implementation dependent 
distribution algorithms may be used.

1.4.2.4 Message Distribution the SG

In order to direct messages received from the SS7 MTP3 network to the 
appropriate IP destination, the SG must perform a message distribution 
function using information from the received MTP3-User message.

To support this message distribution, the SG must maintain the 
equivalent of a network address translation table, mapping incoming SS7 
message information to an Application Server for a particular 
application and range of traffic.  This is accomplished by comparing 
elements of the incoming SS7 message to provisioned Routing Keys in the 
SG.  These Routing Keys in turn make reference to an Application Server 
that is enabled by one or more ASPs.  These ASPs provide dynamic status 
information on their availability, traffic handling capability and 
congestion to the SG using various management messages defined in the 
M3UA protocol.  

The list of ASPs in an AS is assumed to be dynamic, taking into account 
the availability, traffic handling capability and congestion status of 
the individual ASPs in the list, as well as configuration changes and 
possible fail-over mechanisms. 

Normally, one or more ASPs are active in the AS (i.e., currently 
processing traffic) but in certain failure and transition cases it is 
possible that there may be active ASP available.  Both load-sharing and 
backup scenarios are supported.

When there is no Routing Key match, or only a partial match, for an 
incoming SS7 message, a default treatment MUST be specified.  Possible 
solutions are to provide a default Application Server at the SG that 
directs all unallocated traffic to a (set of) default ASP(s), or to 
drop the message and provide a notification to management.  The 
treatment of unallocated traffic is implementation dependent.

Sidebottom et al                                             [Page 15]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


1.4.2.5 Message Distribution at the ASP

In order to direct messages to the SS7 network, the ASP must also 
perform a message distribution function in order to choose the proper 
SG or SGP for a given message.  This is accomplished by observing the 
Destination Point Code (and possibly other elements of the outgoing
message such as the SLS value), together with the SS7 destination 
availability/restricted/congestion status via the SG(s) and the 
availability of the SG and SGPs themselves.

A remote Signalling Gateway may be composed of one or more SGPs that 
are capable of routing SS7 traffic.  As is the case with ASPs, a 
dynamic list of SGPs in an SG can be maintained, taking into account 
the availability status of the individual SGPs, configuration changes 
and fail-over mechanisms. There is, however, no M3UA messaging to 
manage the status of an SGP. Whenever an SCTP association to an SGP 
exists, it is assumed to be available.  Also, every SGP of one SG 
communicating with one ASP regarding one AS provides identical SS7 
connectivity to this ASP.

1.4.3 SS7 and M3UA Interworking

In the case of SS7 and M3UA inter-working, the M3UA adaptation layer is 
designed to provide an extension of the MTP3 defined user primitives.

1.4.3.1 Signalling Gateway SS7 Layers

The SG is responsible for terminating MTP Level 3 of the SS7 protocol, 
and offering an IP-based extension to its users.

>From an SS7 perspective, it is expected that the Signalling Gateway 
(SG) transmits and receives SS7 Message Signalling Units (MSUs) to and 
from the PSTN over a standard SS7 network interface, using the SS7 
Message Transfer Part (MTP) [14,15,16] to provide reliable transport of 
the messages.

As a standard SS7 network interface, the use of MTP Level 2 signalling 
links is not the only possibility.  ATM-based High Speed Links can also 
be used with the services of the Signalling ATM Adaptation Layer (SAAL) 
[17,18].  It is possible for IP-based links to be present, using the 
services of the MTP2-User Adaptation Layer (M2UA) [19].  These SS7 
datalinks may be terminated at a Signalling Transfer Point (STP) or at 
a Signalling End Point (SEP).  Using the services of MTP3, the SG may 
be capable of communicating with remote SS7 SEPs in a quasi-associated 
fashion, where STPs may be present in the SS7 path between the SEP and 
the SG.

Where ATM-based High Speed Links are used in the SS7 network, it is 
possible for the SG to use the services of the MTP-3b [20] for reliable 



Sidebottom et al                                             [Page 16]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


transport to and from an SS7 SEP or STP. The maximum SIF length 
supported by the MTP-3b is 4095 octets compared to the 272-octet 
maximum of the MTP3.  However, for MTP3-Users to take advantage of the 
larger SDU between MTP3-User peers, network architects should ensure 
that MTP3-b is used end-to-end between the SG and the SS7-resident 
peer.  

1.4.3.2 SS7 and M3UA Inter-Working at the SG

The SG provides a functional inter-working of transport functions 
between the SS7 network and the IP network by also supporting the M3UA 
adaptation layer.  It allows the transfer of MTP3-User signalling 
messages to and from an IP-based Application Server Process where the 
peer MTP3-User protocol layer exists.

The Signalling Gateway must maintain knowledge of SS7 node and 
Signalling Point Management Cluster (SPMC) status in their respective 
domains in order to perform a seamless inter-working of the IP-based 
signalling and the SS7 domains.  For example, SG knowledge of the 
availability and/or congestion status of the SPMC and SS7 nodes must be 
maintained and disseminated in the respective networks, in order to 
ensure that end-to-end operation is transparent to the communicating 
SCN protocol peers at the SS7 node and ASP.

When the SG determines that the transport of SS7 messages to an SPMC 
(or possibly to parts of an SPMC) is encountering congestion, the SG 
should inform the MTP3 route management function (by an implementation-
dependent mechanism).  This information is used by the MTP3 to mark the 
"route" to the affected destination as congested and to trigger MTP 
Transfer Controlled (TFC) messages to any SS7 SEPs generating traffic 
to the congested DPC, as per current MTP3 procedures.

When the SG determines that the transport of SS7 messages to all ASPs 
in a particular SPMC is interrupted, then it should similarly inform 
the MTP3 route management function.  This information is used by the 
MTP3 to mark the "route" to the affected destination as unavailable, 
and in the case of the SG acting as a signalling transfer point (i.e., 
the Point Code of the SG is different from that of the SPMC), to send 
MTP Transfer Prohibited (TFP) messages to the relevant adjacent SS7 
nodes, according to the local SS7 network procedures. 

When the SG determines that the transport of SS7 messages to an ASP in 
a particular SPMC can be resumed, the SG should similarly inform the 
MTP3 route management function.  This information is used by the MTP3 
to mark the route to the affected destination as available, and in the 
case of a signalling transfer point, to send MTP Transfer Allowed (TFA) 
messages to the relevant adjacent SS7 nodes, according to the local SS7 
network procedures.  




Sidebottom et al                                             [Page 17]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


For SS7 user part management, it is required that the MTP3-User 
protocols at ASPs receive indications of SS7 signalling point 
availability, SS7 network congestion, and remote User Part 
unavailability as would be expected in an SS7 SEP node.  To accomplish 
this, the MTP-PAUSE, MTP-RESUME and MTP-STATUS indication primitives 
received at the MTP3 upper layer interface at the SG need to be 
propagated to the remote MTP3-User lower layer interface at the ASP. 
(These indication primitives are, of course, also made available to any 
existing local MTP3-Users at the SG, if present.)

It is important to clarify that MTP3 management messages such as TFPs 
or TFAs received from the SS7 network are not "encapsulated" and sent 
blindly to the ASPs.  Rather, the existing MTP3 management procedures 
are followed within the MTP3 function of the SG to re-calculate the 
MTP3 route set status and to initiate any required signalling-route-
set-test procedures into the SS7 network.  Only when an SS7 destination 
status changes are MTP-PAUSE or MTP-RESUME primitives invoked.  These 
primitives can also be invoked due to local SS7 link set conditions as 
per existing MTP3 procedures.

In the case where the MTP in the SG undergoes an MTP restart, event 
communication to the concerned ASPs should be handled as follows:

When the SG discovers SS7 network isolation, the SG sends an indication 
to all concerned available ASPs (i.e., ASPs in the "active" or 
"inactive" state), using a DUNA message.  For the purposes of MTP 
Restart, all SPMCs with point codes different from that of the SG with 
at least one ASP that is active or that has sent an ASPAC message to 
the SG during the first part of the restart procedure should be 
considered as available.  If the M3UA at the SG receives any ASPAC 
messages during the restart procedure, it delays the ASPAC-ACK messages 
until the end of the restart procedure.  During the second part of the 
restart procedure the M3UA at the SG informs all concerned ASPs in the 
"active" or "inactive" state of any unavailable SS7 destinations.  At 
the end of the restart procedure the M3UA sends an ASPAC-ACK message to 
all ASPs in the "active" state.
 
1.4.3.3 Application Server

A cluster of application servers is responsible for providing the 
overall support for one or more SS7 upper layers.  From an SS7 
standpoint, a Signalling Point Management Cluster (SPMC) provides 
complete support for the upper layer service for a given point code.  
As an example, an SPMC providing MGC capabilities must provide complete 
support for ISUP (and any other MTP3 user located at the point code of 
the SPMC) for a given point code, according to the local SS7 network 
specifications.

This measure is necessary to allow the SG to accurately represent the 
signalling point on the local SS7 network.


Sidebottom et al                                             [Page 18]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


In the case where an ASP is connected to more than one SG, the M3UA 
must maintain the status of configured SS7 destinations and route 
messages according to availability/congestion/restricted status of the 
routes to these destinations.

When an ASP enters the "Inactive" state towards an SG the M3UA must 
mark all SS7 destinations configured to be reachable via this SG as 
available.

When the M3UA at an ASP receives a DUNA message indicating SS7 network 
isolation at an SG, it will stop any affected traffic via this SG and 
clear any unavailability state of SS7 destinations via this SG. When 
the M3UA subsequently receives any DUNA messages from an SG it will 
mark the effected SS7 destinations as unavailable via that SG.  When 
the M3UA receives an ASPAC-ACK message it can resume traffic to 
available SS7 destinations via this SG, provided the ASP is in the 
active state towards this SG.

1.4.3.3 IPSP Considerations

Since IPSPs use M3UA in a point-to-point fashion, there is no concept 
of routing of messages beyond the remote end.  Therefore, SS7 and M3UA 
inter-working is not necessary for this model.  

1.4.4 Redundancy Models

The network address translation and mapping function of the M3UA layer 
supports signalling process fail-over functions in order to support a 
high availability of call and transaction processing capability.

1.4.4.1 Application Server Redundancy

All MTP3-User messages (e.g., ISUP, SCCP) incoming to an SG from the 
SS7 network are assigned to a unique Application Server, based on the 
information in the message and the provisioned Routing Keys.

The Application Server is, in practical terms, a list of all ASPs 
configured to process a range of MTP3-User traffic defined by one 
Routing Key.  One or more ASPs in the list are normally active (i.e., 
handling traffic) while any others may be unavailable or inactive, to 
be possibly used in the event of failure or unavailability of the 
active ASP(s).  

The fail-over model supports an "n+k" redundancy model, where "n" ASPs 
is the minimum number of redundant ASPs required to handle traffic and 
"k" ASPs are available to take over for a failed or unavailable ASP.  A 
"1+1" active/standby redundancy is a subset of this model. A simplex 
"1+0" model is also supported as a subset, with no ASP redundancy.




Sidebottom et al                                             [Page 19]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


At the SG, an Application Server list contains active and inactive ASPs 
to support ASP load-sharing and fail-over procedures.  The list of ASPs 
within a logical Application Server is kept updated in the SG to 
reflect the active Application Server Process(es).

To avoid a single point of failure, it is recommended that a minimum of 
two ASPs be in the list, resident in separate hosts and therefore 
available over different SCTP Associations.  For example, in the 
network shown in Figure 1, all messages to DPC x could be sent to ASP1 
in Host1 or ASP1 in Host2.  The AS list at SG1 might look like the 
following:

    Routing Key {DPC=x) - "Application Server #1"
        ASP1/Host1  - State=Up, Active
        ASP1/Host2  - State=Up, Inactive

In this "1+1" redundancy case, ASP1 in Host1 would be sent any incoming 
message with DPC=x.  ASP1 in Host2 would normally be brought to the 
active state upon failure of, or loss of connectivity to, ASP1/Host1. 
In this example, both ASPs are Up, meaning that the related SCTP 
association and far-end M3UA peer is ready.

The AS List at SG1 might also be set up in load-share mode:

    Routing Key {DPC=x) - "Application Server #1"
        ASP1/Host1 - State = Up, Active
        ASP1/Host2 - State = Up, Active

In this case, both the ASPs would be sent a portion of the traffic.  
For example the two ASPs could together form a database, where incoming 
queries may be sent to any active ASP.

Care must be exercised by a Network Operator in the selection of the 
routing information to be used as the Routing Key for a particular AS.  
For example, where Application Servers are defined using ranges of ISUP 
CIC values, the Operator is implicitly splitting up control of the 
related circuit groups.  Some CIC value range assignments may interfere 
with ISUP circuit group management procedures.  

In the process of fail-over, it is recommended that in the case of ASPs 
supporting call processing, stable calls do not fail.  It is possible 
that calls in "transition" MAY fail, although measures of communication 
between the ASPs involved can be used to mitigate this.  For example, 
the two ASPs MAY share call state via shared memory, or MAY use an ASP 
to ASP protocol to pass call state information.  Any ASP-to-ASP 
protocol is outside the scope of this document.






Sidebottom et al                                             [Page 20]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


1.4.4.2 Signalling Gateway Redundancy

Signalling Gateways MAY also be distributed over multiple hosts.  Much 
like the AS model, SGs may be comprised of one or more SG Processes 
(SGPs), distributed over one or more hosts, using an active/standby or 
a load-sharing model.  An SGP is viewed as a remote SCTP end-point from 
an ASP perspective.  There is, however, no M3UA protocol to manage the 
status of an SGP. Whenever an SCTP association to an SGP exists, the 
SGP is assumed to be available.  Also, every SGP within an SG 
communicating with an ASP provides identical SS7 connectivity to this 
ASP. Should an SGP lose all or partial SS7 connectivity and other SGPs 
exist, the SGP must terminate the SCTP associations to the concerned 
ASPs.

It is therefore possible for an ASP to route signalling messages 
destined to the SS7 network using more than one SGP.  In this model, a 
Signalling Gateway is deployed as a cluster of hosts acting as a single 
SG.  A primary/back-up redundancy model is possible, where the 
unavailability of the SCTP association to a primary SGP could be used 
to reroute affected traffic to an alternate SGP.  A load-sharing model 
is possible, where the signalling messages are load-shared between 
multiple SGPs.

It may also be possible for an ASP to use more than one SG to access a 
specific SS7 end point, in a model that resembles an SS7 STP mated 
pair.  Typically, SS7 STPs are deployed in mated pairs, with traffic 
load-shared between them.  Other models are also possible, subject to 
the limitations of the local SS7 network provisioning guidelines.

>From the perspective of the M3UA at an ASP, a particular SG is capable 
of transferring traffic to an SS7 destination if an SCTP association 
with at least one SGP of the SG is established, the SGP has returned an 
ASPAC Ack message acknowledging to the ASP M3UA that the ASP is 
actively handling traffic for that destination, and the SG has not 
indicated that the destination is inaccessible.  When an ASP is 
configured to use multiple SGs for transferring traffic to the SS7 
network, the ASP must maintain knowledge of the current capability of 
the SGs to handle traffic to destinations of interest.  This 
information is crucial to the overall reliability of the service, for 
both active/standby and load-sharing model, in the event of failures, 
recovery and maintenance activities.  The ASP M3UA may also use this 
information for congestion avoidance purposes.  The distribution of the 
MTP3-user messages over the SGs should be done in such a way to 
minimize message mis-sequencing, as required by the SS7 User Parts.

1.4.5 Flow Control
Local Management at an ASP may wish to stop traffic across an SCTP 
association in order to temporarily remove the association from service 
or to perform testing and maintenance activity.  The function could 
optionally be used to control the start of traffic on to a newly 
available SCTP association.

Sidebottom et al                                             [Page 21]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


1.4.6 Congestion Management

The M3UA Layer is informed of local and IP network congestion by means 
of an implementation-dependent function (e.g., an implementation-
dependent indication from the SCTP of IP network congestion). 

At an ASP or IPSP, the M3UA indicates congestion to local MTP3-Users by 
means of an MTP-Status primitive, as per current MTP3 procedures, to 
invoke appropriate upper layer responses.  

When an SG determines that the transport of SS7 messages to a 
Signalling Point Management Cluster (SPMC) is encountering congestion, 
the SG should trigger SS7 MTP3 Transfer Controlled management messages 
to originating SS7 nodes, as per current MTP3 procedures. The 
triggering of SS7 MTP3 Management messages from an SG is an 
implementation-dependent function.  

The M3UA at an ASP or IPSP should indicate local congestion to an M3UA 
peer with an SCON message.  When an SG M3UA receives an SCON message 
from an ASP, and the SG determines that an SPMC is now encountering 
congestion, it should trigger SS7 MTP3 Transfer Controlled management 
messages to concerned SS7 destinations according to current MTP 
procedures.

1.4.7 SCTP Stream Mapping.  

The M3UA at both the SG and ASP also supports the assignment of 
signalling traffic into streams within an SCTP association.  Traffic 
that requires sequencing must be assigned to the same stream.  To 
accomplish this, MTP3-User traffic may be assigned to individual 
streams based on, for example, the SLS value in the MTP3 Routing Label 
or the ISUP CIC assignment, subject of course to the maximum number of 
streams supported by the underlying SCTP association.  

The use of SCTP streams within M3UA is recommended in order to minimize 
transmission and buffering delays, therefore improving the overall 
performance and reliability of the signalling elements.  The 
distribution of the MTP3 user messages over the various streams should 
be done in such a way to minimize message mis-sequencing, as required 
by the SS7 User Parts.

1.4.8 Client/Server Model

The SG takes on the role of server while the ASP is the client. ASPs 
MUST initiate the SCTP association to the SG.

In the case of IPSP to IPSP communication, the peer endpoints using 
M3UA SHOULD be configured so that one always takes on the role of 
client and the other the role of server for initiating SCTP 
associations and M3UA messaging.


Sidebottom et al                                              [Page 22]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


The SCTP (and UDP/TCP) Registered User Port Number Assignment for M3UA 
is 2905.


1.5 Sample Configurations

1.5.1 Example 1: ISUP message transport

  ********   SS7   *****************   IP   ********
  * SEP  *---------*      SG       *--------* ASP  *
  ********         *****************        ********

  +------+                                  +------+
  | ISUP |               (NIF)              | ISUP |
  +------+         +------+-+------+        +------+
  | MTP3 |         | MTP3 | | M3UA |        | M3UA |
  +------|         +------+ +------+        +------+
  | MTP2 |         | MTP2 | | SCTP |        | SCTP |
  +------+         +------+ +------+        +------+
  |  L1  |         |  L1  | |  IP  |        |  IP  |
  +------+         +------+ +------+        +------+ 
      |_______________|         |______________|

    SEP - SS7 Signalling End Point
    SCTP - Stream Control Transmission Protocol
    NIF - Nodal Inter-working Function

In this example, the SG provides an implementation-dependent nodal 
inter-working function (NIF) that allows the MGC to exchange SS7 
signalling messages with the SS7-based SEP.  The NIF within the SG 
serves as the interface within the SG between the MTP3 and M3UA.  This 
nodal inter-working function has no visible peer protocol with either 
the MGC or SEP.  It also provides network status information to one or 
both sides of the network.

For internal SG modeling purposes, at the NIF level, SS7 signalling 
messages that are destined to the MGC are received as MTP-TRANSFER 
indication primitives from the MTP Level 3 upper layer interface and 
are sent to the local M3UA-resident message distribution function for 
ongoing routing to the final IP destination.  MTP-TRANSFER primitives 
received from the local M3UA network address translation and mapping 
function are sent to the MTP Level 3 upper layer interface as MTP-
TRANSFER request primitives for on-going MTP Level 3 routing to an SS7 
SEP.  For the purposes of providing SS7 network status information the 
NIF also delivers MTP-PAUSE, MTP-RESUME and MTP-STATUS indication 
primitives received from the MTP Level 3 upper layer interface to the 
local M3UA-resident management function. In addition, as an 
implementation and network option, restricted destinations are 
communicated from MTP network management to the local M3UA-resident 
management function.


Sidebottom et al                                              [Page 23]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


1.5.2  Example 2: SCCP Transport between IPSPs

        ********    IP    ********
        * IPSP *          * IPSP *
        ********          ********
  
        +------+          +------+
        |SCCP- |          |SCCP- |
        | User |          | User |
        +------+          +------+
        | SCCP |          | SCCP |
        +------+          +------+
        | M3UA |          | M3UA |
        +------+          +------+
        | SCTP |          | SCTP |
        +------+          +------+
        |  IP  |          |  IP  |
        +------+          +------+
            |________________|

This example shows an architecture where no Signalling Gateway is used.  
In this example, SCCP messages are exchanged directly between two IP-
resident IPSPs with resident SCCP-User protocol instances, such as 
RANAP or TCAP.  SS7 network inter-working is not required, therefore 
there is no MTP3 network management status information for the SCCP and 
SCCP-User protocols to consider.  Any MTP-PAUSE, -RESUME or -STATUS 
indications from the M3UA to the SCCP should consider the status of the 
SCTP Association and underlying IP network and any congestion 
information received from the remote site.    























Sidebottom et al                                             [Page 24]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


1.5.3 Example 3: SG resident SCCP layer, with remote ASP

  ********   SS7   *****************   IP   ********
  * SEP  *---------*               *--------*      *
  *  or  *         *      SG       *        * ASP  *
  * STP  *         *               *        *      *
  ********         *****************        ********

  +------+         +---------------+        +------+
  | SCCP-|         |     SCCP      |        | SCCP-|
  | User |         +---------------+        | User |
  +------+           |   _____   |          +------+
  | SCCP |           |  |     |  |          | SCCP |
  +------+         +------+-+------+        +------+
  | MTP3 |         | MTP3 | | M3UA |        | M3UA |
  +------|         +------+ +------+        +------+
  | MTP2 |         | MTP2 | | SCTP |        | SCTP |
  +------+         +------+ +------+        +------+
  |  L1  |         |  L1  | |  IP  |        |  IP  |
  +------+         +------+ +------+        +------+
      |_______________|         |______________|

    STP - SS7 Signalling Transfer Point

In this example, the SG contains an instance of the SS7 SCCP protocol 
layer that may, for example, perform the SCCP Global Title Translation 
(GTT) function for messages logically addressed to the SG SCCP.  If the 
result of a GTT for an SCCP message yields an SS7 DPC or DPC/SSN 
address an SCCP peer located in the IP domain, the resulting MTP-
TRANSFER request primitive is sent to the local M3UA-resident network 
address translation and mapping function for ongoing routing to the 
final IP destination.  

Similarly, the SCCP instance in an SG can perform the SCCP GTT service 
for messages logically addressed to it from SCCP peers in the IP 
domain.  In this case, MTP-TRANSFER messages are sent from the local 
M3UA-resident network address translation and mapping function to the 
SCCP for GTT.  If the result of the GTT yields the address of an SCCP 
peer in the SS7 network then the resulting MTP-TRANSFER request is 
given to the MTP3 for delivery to an SS7-resident node.

It is possible that the above SCCP GTT at the SG could yield the 
address of an SCCP peer in the IP domain and the resulting MTP-TRANSFER 
primitive would be sent back to the M3UA for delivery to an IP 
destination.

For internal SG modeling purposes, this may be accomplished with the 
use of an implementation-dependent nodal inter-working function within 
the SG that effectively sits below the SCCP and routes MTP-TRANSFER 
messages to/from both the MTP3 and the M3UA, based on the SS7 DPC or 
DPC/SSN 

Sidebottom et al                                              [Page 25]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


address information.  This nodal inter-working function has no visible 
peer protocol with either the ASP or SEP.

Note that the services and interface provided by the M3UA are the same 
as in Example 1 and the functions taking place in the SCCP entity are 
transparent to M3UA.  The SCCP protocol functions are not reproduced in 
the M3UA protocol.


1.6 Definition of M3UA Boundaries

1.6.1 Definition of the boundary between M3UA and an MTP3-User.

>From ITU Q.701 [14]:

   MTP-TRANSFER request
   MTP-TRANSFER indication
   MTP-PAUSE indication
   MTP-RESUME indication
   MTP-STATUS indication  

1.6.2 Definition of the boundary between M3UA and SCTP

An example of the upper layer primitives provided by the SCTP are 
provided in Reference [13] Section 10.

1.6.3 Definition of the Boundary between M3UA and Layer Management

   M-SCTP ESTABLISH request
   Direction: LM -> M3UA
   Purpose: LM requests ASP to establish an SCTP association with an 
            SG.
  	
   M-STCP ESTABLISH confirm 
   Direction: M3UA -> LM
   Purpose: ASP confirms to LM that it has established an SCTP 
            association with an SG.

   M-SCTP ESTABLISH indication 
   Direction: M3UA -> LM
   Purpose: M3UA informs LM that a remote ASP has established an SCTP 
            association.

   M-SCTP RELEASE request 
   Direction: LM -> M3UA
   Purpose: LM requests ASP to release an SCTP association with SG.






Sidebottom et al                                             [Page 26]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


   M-SCTP RELEASE confirm
   Direction: M3UA -> LM
   Purpose: ASP confirms to LM that it has released SCTP association 
            with SG.

   M-SCTP RELEASE indication
   Direction: M3UA -> LM
   Purpose: M3UA informs LM that a remote ASP has released an SCTP 
            Association or the SCTP association has failed.

   M-SCTP STATUS request 
   Direction: LM -> M3UA
   Purpose: LM requests M3UA to report the status of an SCTP 
            association.

   M-SCTP STATUS confirm 
   Direction: M3UA -> LM
   Purpose: M3UA reports the status of an SCTP association.

   M-ASP STATUS request 
   Direction: LM -> M3UA
   Purpose: LM requests M3UA to report the status of a local or remote 
            ASP.

   M-ASP STATUS confirm 
   Direction: M3UA -> LM
   Purpose: M3UA reports status of local or remote ASP.

   M-AS STATUS request 
   Direction: LM -> M3UA
   Purpose: LM requests M3UA to report the status of an AS.

   M-AS STATUS confirm 
   Direction: M3UA -> LM
   Purpose: M3UA reports the status of an AS.

   M-NOTIFY indication 
   Direction: M3UA -> LM
   Purpose: M3UA reports that it has received a NOTIFY message 
            from its peer.

   M-ERROR indication 
   Direction: M3UA -> LM
   Purpose: M3UA reports that it has received an ERROR message from 
            its peer or that a local operation has been unsuccessful.

   M-ASP UP request 
   Direction: LM -> M3UA
   Purpose: LM requests ASP to start its operation and send an ASP-UP
            Message to its peer.


Sidebottom et al                                             [Page 27]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


   M-ASP UP confirm
   Direction: M3UA -> LM
   Purpose: ASP reports that is has received an ASP UP Acknowledgement
            message from the SG.

   M-ASP UP indication
   Direction: M3UA -> LM
   Purpose: M3UA reports it has successfully processed an incoming ASP-
            UP request from its peer.

   M-ASP DOWN request 
   Direction: LM -> M3UA
   Purpose: LM requests ASP to stop its operation and send an ASP-DOWN 
            Message to its peer.

   M-ASP DOWN confirm
   Direction: M3UA -> LM
   Purpose: ASP reports that is has received an ASP DOWN
            Acknowledgement message from the SG.

   M-ASP DOWN indication
   Direction: M3UA -> LM
   Purpose: M3UA reports it has successfully processed an incoming ASP-
            DOWN request from its peer.

   M-ASP-ACTIVE request
   Direction: LM -> M3UA
   Purpose: LM requests ASP to send an ASP-ACTIVE message to its peer.

   M-ASP ACTIVE confirm
   Direction: M3UA -> LM
   Purpose: ASP reports that is has received an ASP ACTIVE
            Acknowledgement message from the SG.

   M-ASP ACTIVE indication
   Direction: M3UA -> LM
   Purpose: LM reports it has successfully processed an incoming ASP-
            ACTIVE request from its peer.

   M-ASP-INACTIVE request
   Direction: LM -> M3UA
   Purpose: LM requests ASP to send an ASP- Inactive message to the SG.

   M-ASP INACTIVE confirm
   Direction: LM -> M3UA
   Purpose: ASP reports that is has received an ASP INACTIVE
            Acknowledgement message from the SG.





Sidebottom et al                                             [Page 28]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


   M-ASP INACTIVE indication
   Direction: M3UA -> LM
   Purpose: LM reports it has successfully processed an incoming ASP-
            INACTIVE request from its peer.

   M-AS ACTIVE indication
   Direction: M3UA -> LM
   Purpose: LM reports that an AS has moved to the ACTIVE state.

   M-AS INACTIVE indication
   Direction: M3UA -> LM
   Purpose: LM reports that an AS has moved to the INACTIVE state.

   M-AS DOWN indication
   Direction: M3UA -> LM
   Purpose: LM reports that an AS has moved to the DOWN state.


2.0 Conventions

The keywords MUST, MUST NOT, REQUIRED, SHALL, SHALL NOT, SHOULD, SHOULD 
NOT, RECOMMENDED, NOT RECOMMENDED, MAY, and OPTIONAL, when they appear 
in this document, are to be interpreted as described in [RFC2119].


3.0 M3UA Protocol Elements

The general M3UA message format includes a Common Message Header 
followed by zero or more parameters as defined by the Message Type.  
For forward compatibility, all Message Types may have attached 
parameters even if none are specified in this version.

3.1 Common Message Header

The protocol messages for MTP3-User Adaptation require a message header 
which contains the adaptation layer version, the message type, and 
message length.


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Version    |   Reserved    | Message Class | Message Type  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        Message Length                         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                                                               /




Sidebottom et al                                             [Page 29]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


All fields in an M3UA message MUST be transmitted in the network byte 
order, unless otherwise stated.

3.1.1 M3UA Protocol Version: 8 bits (unsigned integer)

   The version field contains the version of the M3UA adaptation layer.  

   The supported versions are the following:

         1      Release 1.0

3.1.2  Message Classes and Types

The following list contains the valid Message Classes:

Message Class: 8 bits (unsigned integer)

   The following list contains the valid Message Type Classes:

     0     Management (MGMT) Message [IUA/M2UA/M3UA/SUA]
     1     Transfer Messages [M3UA]
     2     SS7 Signalling Network Management (SSNM) Messages [M3UA/SUA]
     3     ASP State Maintenance (ASPSM) Messages [IUA/M2UA/M3UA/SUA]
     4     ASP Traffic Maintenance (ASPTM) Messages [IUA/M2UA/M3UA/SUA]
     5     Q.921/Q.931 Boundary Primitives Transport (QPTM) Messages 
              [IUA]
     6     MTP2 User Adaptation (MAUP) Messages [M2UA]
     7     Connectionless Messages [SUA]
     8     Connection-Oriented Messages [SUA]
     9     Routing Key Management (RKM) Messages (M3UA)
  10 to 127 Reserved by the IETF
  28 to 255 Reserved for IETF-Defined Message Class extensions

Message Type: 8 bits (unsigned integer)

   The following list contains the message types for the defined 
   messages.

     Management (MGMT) Message

         0        Error (ERR)
         1        Notify (NTFY)
      2 to 127    Reserved by the IETF
    128 to 255    Reserved for IETF-Defined MGMT extensions

     Transfer Messages

         0        Reserved
         1        Payload Data (DATA)      
      2 to 127    Reserved by the IETF
    128 to 255    Reserved for IETF-Defined Transfer extensions

Sidebottom et al                                             [Page 30]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001   


     SS7 Signalling Network Management (SSNM) Messages

         0        Reserved
         1        Destination Unavailable (DUNA)
         2        Destination Available (DAVA)
         3        Destination State Audit (DAUD)
         4        SS7 Network Congestion State (SCON)
         5        Destination User Part Unavailable (DUPU)
         6        Destination Restricted (DRST)      
      7 to 127    Reserved by the IETF
    128 to 255    Reserved for IETF-Defined SSNM extensions

  ASP State Maintenance (ASPSM) Messages

         0        Reserved
         1        ASP Up (UP)
         2        ASP Down (DOWN)         
         3        Heartbeat (BEAT)
         4        ASP Up Ack (UP ACK)
         5        ASP Down Ack (DOWN ACK)
         6        Heatbeat Ack (BEAT ACK)
      7 to 127    Reserved by the IETF
    128 to 255    Reserved for IETF-Defined ASPSM extensions

  ASP Traffic Maintenance (ASPTM) Messages

         0        Reserved
         1        ASP Active (ACTIVE)
         2        ASP Inactive (INACTIVE)
         3        ASP Active Ack (ACTIVE ACK) 
         4        ASP Inactive Ack (INACTIVE ACK)
      5 to 127    Reserved by the IETF
    128 to 255    Reserved for IETF-Defined ASPTM extensions

  Routing Key Management (RKM) Messages

         0        Reserved
         1        Registration Request (REG REQ)
         2        Registration Response (REG RSP)
         3        Deregistration Request (DEREG REQ) 
         4        Deregistration Response (DEREG RSP)
      5 to 127    Reserved by the IETF
    128 to 255    Reserved for IETF-Defined ASPTM extensions

3.1.3  Reserved: 8 bits

   The Reserved field SHOULD be set to all '0's and ignored by the 
   receiver.




Sidebottom et al                                             [Page 31]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


3.1.4  Message Length: 32-bits (unsigned integer)

   The Message Length defines the length of the message in octets, 
   including the Common Header.  For messages with a final parameter 
   containing padding, the parameter padding MUST be included in the 
   Message Length. 

   Note: A receiver SHOULD accept the message whether or not the final 
   parameter padding is included in the message length.  


3.2 Variable-Length Parameter Format

M3UA messages consist of a Common Header followed by zero or more 
variable length parameters, as defined by the message type.  All the 
parameters contained in a message are defined in a Tag-Length-Value 
format as shown below.  

   0                   1                   2                   3
   0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
  |          Parameter Tag        |       Parameter Length        |
  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
  \                                                               \
  /                       Parameter Value                         /
  \                                                               \
  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

Where more than one parameter is included in a message, the parameters 
may be in any order, except where explicitly mandated.  A receiver 
SHOULD accept the parameters in any order. 

Parameter Tag: 16 bits (unsigned integer)

   The Tag field is a 16-bit identifier of the type of parameter. It 
   takes a value of 0 to 65534.  The parameter Tags defined are as 
   follows:

         0        Reserved
         1        Network Appearance
         2        Protocol Data 1
         3        Protocol Data 2
         4        Info String
         5        Affected Destinations
         6        Routing Context
         7        Diagnostic Information
         8        Heartbeat Data
         9        User/Cause
        10        Reason
        11        Traffic Mode Type
  

Sidebottom et al                                             [Page 32]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


        12        Error Code
        13        Status Type/ID
        14        Congestion Indications
        15        Concerned Destination
        16        Routing Key
        17        Registration Result
        18        De-registration Result
        19        Local_Routing Key Identifier
        20        Destination Point Code
        21        Service Indicators
        22        Subsystem Numbers
        23        Originating Point Code List
        24        Circuit Range
        25        Registration Results
        26        De-Registration Results
     27 to 65534  Reserved by the IETF

   The value of 65535 is reserved for IETF-defined extensions.  Values 
   other than those defined in specific parameter description are 
   reserved for use by the IETF. 

Parameter Length: 16 bits (unsigned integer)

   The Parameter Length field contains the size of the parameter in 
   bytes, including the Parameter Tag, Parameter Length, and Parameter 
   Value fields. The Parameter Length does not include any padding 
   bytes.

Parameter Value: variable-length.

   The Parameter Value field contains the actual information to be 
   transferred in the parameter. 

   The total length of a parameter (including Tag, Parameter Length and 
   Value fields) MUST be a multiple of 4 bytes. If the length of the 
   parameter is not a multiple of 4 bytes, the sender pads the 
   Parameter at the end (i.e., after the Parameter Value field) with 
   all zero bytes. The length of the padding is NOT included in the 
   parameter length field. A sender SHOULD NEVER pad with more than 3 
   bytes. The receiver MUST ignore the padding bytes.


3.3 Transfer Messages

The following section describes the Transfer messages and parameter 
contents. 






Sidebottom et al                                             [Page 33]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001   


3.3.1 Payload Data Message (DATA)

The DATA message contains the SS7 MTP3-User protocol data, which is an 
MTP-TRANSFER primitive, including the complete MTP3 Routing Label. The 
Data message contains the following variable length parameters:

     Network Appearance       Optional
     Protocol Data 1 or 2     Mandatory

The following format MUST be used for the Data Message:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 1            |          Length = 8           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Network Appearance*                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 3            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                        Protocol Data                          /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


Network Appearance: 32-bits (unsigned integer)

   The optional Network Appearance parameter identifies the SS7 network 
   context for the message, for the purposes of logically separating 
   the signalling traffic between the SG and the Application Server 
   Process over a common SCTP Association.  An example is where an SG 
   is logically partitioned to appear as an element in four different 
   national SS7 networks.

   In a Data message, the Network Appearance implicitly defines the SS7 
   Point Code format used, the SS7 Network Indicator value, and the 
   MTP3 and possibly the MTP3-User protocol type/variant/version used 
   within the SS7 network partition.  Where an SG operates in the 
   context of a single SS7 network, or individual SCTP associations are 
   dedicated to each SS7 network context, the Network Appearance 
   parameter is not required.

   The Network Appearance parameter value is of local significance 
   only, coordinated between the SG and ASP. Therefore, in the case 
   where an ASP is connected to more than one SG, the same SS7 network 
   context may be identified by different Network Appearances depending 
   over which SG a message is being transmitted/received.




Sidebottom et al                                             [Page 34]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


   Where the optional Network Appearance parameter is present, it must 
   be the first parameter in the message as it defines the format of 
   the Protocol Data field.

Protocol Data 1 or 2: variable length

   One of two possible Protocol Data parameters are included in a DATA 
   message: Protocol Data 1 or Protocol Data 2.  

   The Protocol Data 1 parameter contains the original SS7 MTP3 
   message, including the Service Information Octet and Routing Label. 

   The Protocol Data 1 parameter contains the following fields:

       Service Information Octet. Includes:
            Service Indicator, 
            Network Indicator,
            and Spare/Priority codes

       Routing Label. Includes:
            Destination Point Code,
            Originating Point Code,
            And Signalling Link Selection Code (SLS)

       User Protocol Data.  Includes:
            MTP3-User protocol elements (e.g., ISUP, SCCP, or TUP 
               parameters)
       
   The Protocol Data 2 parameter contains all the information in 
   Protocol Data 1 as described above, plus the MTP2 Length Indicator 
   octet.  The MTP2 Length Indicator (LI) octet appears before the SIO 
   and Routing Label information.  The MTP2 Length Indicator octet is 
   required for some national MTP variants that use the spare bits in 
   the LI to carry additional information of interest to the MTP3 and 
   MTP3-User (e.g., the Japan TTC standard use of LI spare bits to 
   indicate message priority) 

   The Payload Data format is as defined in the relevant MTP standards 
   for the SS7 protocol being transported.  The format is either 
   implicitly known or identified by the Network Appearance parameter.  
   Note: In the SS7 Recommendations, the format of the messages and 
   fields within the messages are based on bit transmission order.  In 
   these recommendations the Least Significant Bit (LSB) of each field 
   is positioned to the right.  For this document the received SS7 
   fields are populated octet by octet as received into the 4-octet 
   word as shown in the examples below.

   For the ANSI protocol example, the Protocol Data field format is 
   shown below:



Sidebottom et al                                             [Page 35]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      SIO      |  DPC Member  |  DPC Cluster  |  DPC Network   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  OPC Member  |  OPC Cluster  |  OPC Network   |      SLS      | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                        Protocol Data                          /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   |MSB---------------------------------------------------------LSB|


   Within each octet the Least Significant Bit (LSB) per the SS7 
   Recommendations is to the right (e.g., bit 7 of SIO is the LSB).

   For the ITU international protocol example, the Protocol Data field 
   is shown below.


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |      SIO      | DPC     | DPC |OPC| DPC | DPC |   OPC       |@|
    |               | Region *| SP *|SP*|Zone*| reg.|  Region    *| |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |  SLS  | OPC |$|      Protocol                                 |
    |      *| SP *| |        Data                                   |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

    * marks LSB of each field;  @ = OPC SP MSB;  $ = OPC region MSB



3.4 SS7 Signalling Network Management (SSNM) Messages

3.4.1 Destination Unavailable (DUNA)

The DUNA message is sent from the SG to all concerned ASPs to indicate 
that the SG has determined that one or more SS7 destinations are 
unreachable.  It is also sent in response to a message from the ASP to 
an unreachable SS7 destination.  As an implementation option the SG may 
suppress the sending of subsequent "response" DUNAs regarding a certain 
unreachable SS7 destination for a certain period in order to give the 
remote side time to react. The MTP3-User at the ASP is expected to stop 
traffic to the affected destination through the SG initiating the DUNA 
as per the defined MTP3-User procedures. 



Sidebottom et al                                             [Page 36]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


The DUNA message contains the following parameters:

     Network Appearance      Optional
     Affected Destinations   Mandatory
     Info String             Optional

The format for DUNA Message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |            Tag = 1            |           Length =8           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Network Appearance*                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 5            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Mask      |                 Affected DPC 1                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                              ...                              /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Mask      |                 Affected DPC n                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |             Tag = 4           |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


Network Appearance: 32-bit unsigned integer

   See Section 3.3.1

Affected Destinations: n x 32-bits

   The Affected Destinations parameter contains up to sixteen Affected 
   Destination Point Code fields, each a three-octet parameter to allow 
   for 14-, 16- and 24-bit binary formatted SS7 Point Codes.  Affected 
   Point Codes that are less than 24-bits, are padded on the left to 
   the 24-bit boundary.  The encoding is shown below for ANSI and ITU 
   Point Code examples.

   





Sidebottom et al                                             [Page 37]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


ANSI 24-bit Point Code:

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |     Mask      |    Network    |    Cluster    |     Member    |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                      |MSB-----------------------------------------LSB|

   ITU 14-bit Point Code:

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |     Mask      |0 0 0 0 0 0 0 0 0 0|Zone |     Region    | SP  |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                                           |MSB--------------------LSB|

   It is optional to send an Affected Destinations parameter with more 
   than one Affected DPC but it is mandatory to receive and process it.  
   All the Affected DPCs included must be within the same Network 
   Appearance.  Including multiple Affected DPCs may be useful when 
   reception of an MTP3 management message or a linkset event 
   simultaneously affects the availability status of a list of 
   destinations at an SG.  

Mask: 8-bits (unsigned integer)

   The Mask field associated with each Affected DPC in the Affected 
   Destinations parameter, used to identify a contiguous range of 
   Affected Destination Point Codes, independent of the point code 
   format.  Identifying a contiguous range of Affected DPCs may be 
   useful when reception of an MTP3 management message or a linkset 
   event simultaneously affects the availability status of a series of 
   destinations at an SG.  For example, if all DPCs in an ANSI cluster 
   are determined to be unavailable due to local linkset 
   unavailability, the DUNA could identify potentially 256 Affected 
   DPCs in a single Affected DPC field. 

   The Mask parameter represents a bit mask that can be applied to the 
   related Affected DPC field.  The bit mask identifies how many bits 
   of the Affected DPC field are significant and which are effectively 
   "wildcarded".  For example, a mask of "8" indicates that the least 
   significant eight bits of the DPC is "wildcarded".  For an ANSI 24-
   bit Affected DPC, this is equivalent to signalling that all DPCs in 
   an ANSI Cluster are unavailable.  A mask of "3" indicates that the 
   least significant three bits of the DPC is "wildcarded".  For a 14-
   bit ITU Affected DPC, this is equivalent to signaling that an ITU 

   
Sidebottom et al                                             [Page 38]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


   Region is unavailable. A mask value equal to the number of bits in 
   the DPC indicates that the entire network appearance is affected û 
   this is used to indicate network isolation to the ASP.

Info String: variable length

   The optional INFO String parameter can carry any 8-bit ASCII 
   character string along with the message.  Length of the INFO 
   String parameter is from 0 to 255 characters.  No procedures are 
   presently identified for its use but the INFO String MAY be used by 
   Operators to identify in text form the location reflected by the 
   Affected DPC for debugging purposes.

3.4.2 Destination Available (DAVA)   

The DAVA message is sent from the SG to all concerned ASPs to indicate 
that the SG has determined that one or more SS7 destinations are now 
reachable (and not restricted), or in response to a DAUD message if 
appropriate. The ASP MTP3-User protocol is allowed to resume traffic to 
the affected destination through the SG initiating the DUNA. 

The DAVA message contains the following parameters:

     Network Appearance       Optional
     Affected Destinations    Mandatory
     Info String              Optional

The format and description of the Network Appearance, Affected 
Destinations and Info String parameters is the same as for the DUNA 
message (See Section 3.4.1.)  

3.4.3 Destination State Audit (DAUD)

The DAUD message can be sent from the ASP to the SG to audit the 
availability/congestion state of SS7 routes to one or more affected 
destinations.  

The DAUD message contains the following parameters:

     Network Appearance      Optional
     Affected Destinations   Mandatory
     Info String             Optional

The format and description of DAUD Message parameters is the same as 
for the DUNA message (See Section 3.4.1.)

3.4.4 SS7 Network Congestion (SCON)

The SCON message can be sent from the SG to all concerned ASPs to 
indicate congestion in the SS7 network to one or more destinations, or 


Sidebottom et al                                             [Page 39]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


to an ASP in response to a DATA or DAUD message as appropriate.  For 
some MTP protocol variants (e.g., ANSI MTP) the SCON may be sent when 
the SS7 congestion level changes.  The SCON message MAY also be sent 
from the M3UA of an ASP to an M3UA peer indicating that the M3UA or the 
ASP is congested.

The SCON message contains the following parameters:

     Network Appearance       Optional
     Affected Destinations    Mandatory
     Concerned Destination    Optional     Congestion Indications   
Optional           
     Info String              Optional

The format for SCON Message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 1            |           Length =8           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                       Network Appearance*                     | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 5            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      Mask     |                 Affected DPC 1                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                              ...                              /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      Mask     |                 Affected DPC n                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 15           |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    reserved   |                 Concerned DPC                 |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 14           |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                   Reserved                    |  Cong. Level* |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 4            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                         INFO String*                          /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+





Sidebottom et al                                             [Page 40]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


The format and description of the Network Appearance, Affected 
Destinations, and Info String parameters is the same as for the DUNA 
message (See Section 3.4.1.)

The Affected Destinations parameter can be used to indicate congestion 
of multiple destinations or ranges of destinations.  However, an SCON 
MUST not be delayed in order to "collect" individual congested 
destinations into a single SCON as any delay might affect the timing of 
congestion indications to the M3UA Users.  One use for including a 
range of Congested DPCs is when the SG supports an ANSI cluster route 
set to the SS7 network that becomes congested due to outgoing link set 
congestion. 

Concerned Destination: 32-bits
   
   The optional Concerned Destination parameter is only used if the 
   SCON is sent from an ASP to the SG. It contains the point code of 
   the originator of the message that triggered the SCON. The Concerned 
   Destination parameter contains one Concerned Destination Point Code 
   field, a three-octet parameter to allow for 14-, 16- and 24-bit 
   binary formatted SS7 Point Codes.  A Concerned Point Code that is 
   less than 24-bits, is padded on the left to the 24-bit boundary. The 
   SG sends a Transfer Controlled Message to the Concerned Point Code 
   using the single Affected DPC contained in the SCON to populate the 
   (affected) Destination field of the TFC message. Normally the 
   Affected DPC will be equal to the point code of the ASP.

Congested Indications: 32-bits

   The optional Congestion Indications parameter contains a Congestion 
   Level field.  This optional parameter is used to communicate 
   congestion levels in national MTP networks with multiple congestion 
   thresholds, such as in ANSI MTP3.  For MTP congestion methods 
   without multiple congestion levels (e.g., the ITU international 
   method) the parameter is not included.

Congestion Level field: 8-bits (unsigned integer)

   The Congestion Level field, associated with all of the Affected 
   DPC(s) in the Affected Destinations parameter, contains one of the 
   Following values:

         0     No Congestion or Undefined
         1     Congestion Level 1
         2     Congestion Level 2
         3     Congestion Level 3

   The congestion levels are defined in the congestion method in the 
   appropriate national MTP recommendations [14,15]. 



Sidebottom et al                                             [Page 41]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


3.4.5 Destination User Part Unavailable (DUPU)

The DUPU message is used by an SG to inform an ASP that a remote peer 
MTP3-User Part (e.g., ISUP or SCCP) at an SS7 node is unavailable.

The DUPU message contains the following parameters:

     Network Appearance       Optional
     Affected Destinations    Mandatory
     User/Cause               Mandatory
     Info String              Optional

The format for DUPU Message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 1            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                      Network Appearance*                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 5            |          Length = 8           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Mask = 0    |                  Affected DPC                 |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 9            |          Length = 8           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |             Cause             |            User               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 4            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


User/Cause: 32-bits

   The Unavailability Cause and MTP3-User Identity fields, associated 
   with the Affected DPC in the Affected Destinations parameter, are 
   encoded as follows:

Unavailability Cause field: 16-bits (unsigned integer)

   The Unavailability Cause parameter provides the reason for the 
   unavailability of the MTP3-User.  The valid values for the 
   Unavailability Cause parameter are shown in the following table. 
   The values agree with those provided in the SS7 MTP3 User Part 
   Unavailable message.  Depending on the MTP3 protocol used in the 


Sidebottom et al                                             [Page 42]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


   network appearance, additional values may be used - the 
   specification of the relevant MTP3 protocol variant/version 
   recommendation is definitive.

         0         Unknown
         1         Unequipped Remote User
         2         Inaccessible Remote User

MTP3-User Identity field: 16-bits (unsigned integer)

   The MTP3-User Identity describes the specific MTP3-User that is 
   unavailable (e.g., ISUP, SCCP, ...).  Some of the valid values for 
   the MTP3-User Identity are shown below.  The values agree with those 
   provided in the SS7 MTP3 User Part Unavailable message and Service 
   Indicator.  Depending on the MTP3 protocol variant/version used in 
   the network appearance, additional values may be used.  The relevant 
   MTP3 protocol variant/version recommendation is definitive.

       0 to 2       Reserved
          3         SCCP
          4         TUP
          5         ISUP
       6 to 8       Reserved
          9         Broadband ISUP
         10        Satellite ISUP           
 
The format and description of the Affected Destinations parameter is 
the same as for the DUNA message (See Section 3.4.1.) except that the 
Mask field is not used and only a single Affected DPC is included.  
Ranges and lists of Affected DPCs cannot be signaled in a DUPU, but 
this is consistent with UPU operation in the SS7 network. The Affected 
Destinations parameter in an MTP3 User Part Unavailable message (UPU) 
received by an SG from the SS7 network contains only one destination.

The format and description of the Network Appearance and Info String 
parameters is the same as for the DUNA message (See Section 3.4.1.).


3.4.6 Destination Restricted (DRST)   

The DRST message is optionally sent from the SG to all concerned ASPs 
to indicate that the SG has determined that one or more SS7 
destinations are now restricted, or in response to a DAUD message if 
appropriate. The M3UA at the ASP is expected to send traffic to the 
affected destination via an alternate SG of equal priority, but only if 
such an alternate route exists and is available. If the affected 
destination is currently considered unavailable by the ASP, traffic to 
the affected destination through the SG initiating the DRST should be 
resumed.



Sidebottom et al                                             [Page 43]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


This message is optional for the SG to send and optional for the ASP to 
process. It is for use in the "STP" case described in Section 1.4.2.

The DRST message contains the following parameters:

     Network Appearance       Optional
     Affected Destinations    Mandatory
     Info String              Optional

The format and description of the Network Appearance, Affected 
Destinations and Info String parameters is the same as for the DUNA 
message (See Section 3.4.1.)


3.5 Application Server Process Maintenance (ASPM) Messages

3.5.1 ASP Up (ASPUP)

The ASP UP (ASPUP) message is used to indicate to a remote M3UA peer 
that the Adaptation layer is ready to receive SSNM or ASPM management 
messages for all Routing Keys that the ASP is configured to serve.

The ASPUP message contains the following parameters:

     INFO String                   Optional

The format for ASPUP Message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 4            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


The format and description of the optional Info String parameter is the 
same as for the DUNA message (See Section 3.4.1.)


3.5.2 ASP Up Ack

The ASP UP Ack message is used to acknowledge an ASP-Up message 
received from a  remote M3UA peer.





Sidebottom et al                                             [Page 44]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


The ASPUP Ack message contains the following parameters:

     INFO String (optional)

The format for ASPUP Ack Message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag =4             |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


The format and description of the optional Info String parameter is the 
same as for the DUNA message (See Section 3.4.1.)


3.5.3 ASP Down (ASPDN)

The ASP Down (ASPDN) message is used to indicate to a remote M3UA peer 
that the adaptation layer is NOT ready to receive traffic or 
maintenance messages.

The ASPDN message contains the following parameters:

     Reason         Mandatory
     INFO String    Optional

The format for the ASPDN message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           Tag = 10            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                              Reason                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag =4             |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   \                                                               \
   /                         INFO String*                          /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+





Sidebottom et al                                             [Page 45]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


The format and description of the optional Info String parameter is the 
same as for the DUNA message (See Section 3.4.1.)

Reason: 32-bit (unsigned integer)

   The Reason parameter indicates the reason that the remote M3UA 
   adaptation layer is unavailable.  The valid values for Reason are 
   shown in the following table.

         0       Unspecified
         1       User Unavailable
         2       Management Blocking

3.5.4 ASP Down Ack

The ASP Down Ack message is used to acknowledge an ASP-Down message 
received from a remote M3UA peer, or to reply to an ASPM message from 
an ASP which is locked out for management reasons.  

The ASP Down Ack message contains the following parameters:

     Reason          Mandatory
     INFO String     Optional

The format for the ASPDN Ack message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           Tag = 10            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                              Reason                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 4            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   \                                                               \
   /                         INFO String*                          /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

The format and description of the optional Info String parameter is the 
same as for the DUNA message (See Section 3.4.1.)

The format of the Reason parameter is the same as for the ASP-Down 
message. (See Section 3.4.3)

3.5.5 Registration Request (REG REQ)

The REG REQ message is sent by an ASP to indicate to a remote M3UA peer
that it wishes to register one or more given Routing Key with the 


Sidebottom et al                                             [Page 46]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


remote peer.  Typically, an ASP would send this message to an SGP, and 
expects to receive a REG RSP in return with an associated Routing 
Context value.

The REG REQ message contains the following parameters:

     Routing Key           Mandatory

The format for the REG REQ message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 16           |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                         Routing Key 1                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                              ...                              /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 16           |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                         Routing Key n                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


Routing Key: variable length

   The Routing Key parameter is mandatory. The sender of this message
   expects that the receiver of this message will create a Routing
   Key entry and assign a unique Routing Context value to it, if the 
   Routing Key entry does not already exist.

   The Routing Key parameter may be present multiple times in the same
   message. This is used to allow the registration of multiple Routing 
   Keys in a single message.

   









Sidebottom et al                                             [Page 47]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


The format of the Routing Key parameter is as follows.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Local-RK-Identifier                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                     Destination Point Code                    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                  Network Appearance (optional)                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       SI (optional)                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                         SSN (optional)                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Origination Point Code List (optional)           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                   Circuit Range List (optional)               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

Local-RK-Identifier: 32-bit integer

   The mandatory Local-RK-Identifier field is used to uniquely identify 
   the registration request. The Identifier value is assigned by the 
   ASP, and is used to correlate the response in an REG RSP message 
   with the original registration request. The Identifier value must 
   remain unique until the REG RSP is received.

   The format of the Local-RK-Identifier field is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           Tag = 19            |         Length = 8            |   
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                  Local-RK-Identifier value                    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

Destination Point Code:

   The Destination Point Code parameter is mandatory, and identifies 
   the Destination Point Code of incoming SS7 traffic for which the ASP 
   is registering.  The format is the same as described for the 
   Affected Destination parameter in the DUNA Message (See Section 
   3.4.1). Its format is:







Sidebottom et al                                             [Page 48]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           Tag = 20            |         Length = 8            |   
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Mask = 0   |            Destination Point Code             |   
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

Network Appearance:

   The optional Network Appearance parameter field identifies the SS7 
   Network context for the Routing Key, and has the same format as in 
   the Data message (See Section 3.3.1). Its format is:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 1            |         Length = 8            |   
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+   
   |                     Network Appearance                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

Service Indicators (SI): n X 8-bit integers

   The SI field contains one or more Service Indicators from the values 
   as described in the MTP3-User Identity field of the DUPU Message. 
   The absence of the SI parameter in the Routing Key indicates the use 
   of any SI values, excluding of course MTP management.  Where an SI 
   parameter does not contain a multiple of four SIs, the parameter is 
   padded out to 32-byte alignment.  An SI value of zero is not valid 
   in M3UA.  The SI format is:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           Tag = 21            |         Length = var.         |   
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+   
   |      SI #1    |     SI #2     |    SI #3      |    SI #4      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+   
   /                              ...                              /
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+   
   |      SI #n    |             0 Padding, if necessary           |   
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

Subsystem Numbers (SSN): n X 8-bit integers

   The optional SSN field contains one or more SCCP subsystem numbers, 
   and is used in conjunction with an SI values of 3 (i.e., SCCP) only. 
   Where an SSN parameter does not contain a multiple of four SSNs, the 
   parameter is padded out to 32-byte alignment. The subsystem number 


Sidebottom et al                                             [Page 49]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


   values associated are defined by the local network operator, and 
   typically follow ITU-T Recommendation Q.713.  An SSN value of zero 
   is not valid in M3UA.  The format of this field is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           Tag = 22            |         Length = var.         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     SSN #1    |    SSN #2     |   SSN #3      |   SSN #4      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   /                              ...                              /
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     SSN #n    |             0 Padding, if necessary           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

OPC List:

   The Originating Point Code List parameter contains one or more SS7 
   OPC entries, and its format is the same as the Destination Point 
   Code parameter.

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           Tag = 23            |         Length = var.         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Mask = 0   |          Origination Point Code #1            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Mask = 0   |          Origination Point Code #2            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   /                              ...                              /
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Mask = 0   |          Origination Point Code #n            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

Circuit Range:

   An ISUP controlled circuit is uniquely identified by the SS7 OPC, 
   DPC and CIC value.  For the purposes of identifying Circuit Ranges 
   in an M3UA Routing Key, the optional Circuit Range parameter 
   includes one or more circuit ranges, each identified by an OPC and 
   Upper/Lower CIC value.  The DPC is implicit as it is mandatory and 
   already included in the DPC parameter of the Routing Key.  The 
   Origination Point Code is encoded the same as the Destination Point 
   Code parameter, while the CIC values are 16-bit integers.

   The Circuit Range format is as follows:






Sidebottom et al                                             [Page 50]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           Tag = 24            |         Length = var.         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Mask = 0   |          Origination Point Code #1            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       Lower CIC Value #1      |      Upper CIC Value #1       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Mask = 0   |          Origination Point Code #2            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       Lower CIC Value #2      |      Upper CIC Value #2       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   /                              ...                              /
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Mask = 0   |          Origination Point Code #n            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       Lower CIC Value #n      |      Upper CIC Value #n       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


3.5.6 Registration Response (REG RSP)

The REG RSP message is used as a response to the REG REQ message from a
remote M3UA peer.  It contains indications of success/failure for 
registration requests and returns a unique Routing Context value for 
successful registration requests, to be used in subsequent M3UA Traffic 
Management protocol.

The REG RSP message contains the following parameters:

     Registration Results   Mandatory

The format for the REG RSP message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 25           |         Length = var.         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                    Registration Result 1                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   /                              ...                              /
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                    Registration Result n                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+








Sidebottom et al                                             [Page 51]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


Registration Results:

   The Registration Results parameter contains one or more results, 
   each containing the registration status for a single Routing Key in 
   an REG REQ message.  The number of results in a single REG RSP 
   message MAY match the number of Routing Key parameters found in the 
   corresponding REG REQ message.  The format of each result is as 
   follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                  Local-RK-Identifier value                    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Registration Status                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        Routing Context                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

Local-RK-Identifier: 32-bit integer

   The Local-RK-Identifier contains the same value as found in the
   matching Routing Key parameter found in the REG Req message.

Registration Status: 32-bit integer

   The Registration Result Status field indicates the success or the 
   reason for failure of a registration request.

   Its values may be:

        0           Successfully Registered
        1           Error - Unknown
        2           Error - Invalid DPC
        3           Error - Invalid Network Appearance
        4           Error - Invalid Routing Key
        5           Error - Permission Denied
        6           Error - Overlapping (Non-unique) Routing Key
        7           Error - Routing Key not Provisioned
        8           Error - Insufficient Resources

Routing Context: 32-bit integer

   The Routing Context field contains the Routing Context value for the
   associated Routing Key if the registration was successful. It is set
   to "0" if the registration was not successful.






Sidebottom et al                                             [Page 52]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


3.5.7 De-Registration Request (DEREG REQ)

The DEREG REQ message is sent by an ASP to indicate to a remote M3UA
peer that it wishes to de-register a given Routing Key. Typically, an 
ASP would send this message to an SGP, and expects to receive a DEREG 
RSP in return with the associated Routing Context value.

The DEREG REQ message contains the following parameters:

     Routing Context       Mandatory

The format for the DEREG REQ message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 6            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                       Routing Context                         / 
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

Routing Context: n X 32-bit integers

   The Routing Context parameter contains (a list of) integers indexing 
   the Application Server traffic that the sending ASP is currently 
   registered to receive from the SG but now wishes to deregister. 


3.5.8 De-Registration Response (DEREG RSP)

The DEREG RSP message is used as a response to the DEREG REQ message
from a remote M3UA peer.

The DEREG RSP message contains the following parameters:

     De-registration Results    Mandatory

The format for the DEREG RSP message is as follows:












Sidebottom et al                                             [Page 53]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 18           |           Length = var        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                  De-Registration Result 1                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   /                              ...                              /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                  De-Registration Result n                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

De-Registration Results:

   The De-Registration Results parameter contains one or more results, 
   each containing the de-registration status for a single Routing 
   Context in a DEREG REQ message.  The number of results in a single 
   DEREG RSP message MAY match the number of Routing Contexts found in 
   the corresponding DEREG REQ message.  The format of each result is 
   as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        Routing Context                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                    De-Registration Status                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

Routing Context: 32-bit integer

   The Routing Context field contains the Routing Context value of the
   matching Routing Key to deregister, as found in the DEREG Req.

De-Registration Status: 32-bit integer

   The De-Registration Result Status field indicates the success or the 
   reason for failure of the de-registration.

   Its values may be:
        0           Successfully De-registered
        1           Error - Unknown
        2           Error - Invalid Routing Context
        3           Error - Permission Denied
        4           Error - Not Registered






Sidebottom et al                                             [Page 54]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


3.5.5 ASP Active (ASPAC)

The ASPAC message is sent by an ASP to indicate to a remote M3UA peer 
that it is Active and ready to process signalling traffic for a 
particular Application Server.  The ASPAC affects only the ASP state 
for the routing keys identified by the Routing Contexts, if present.

The ASPAC message contains the following parameters:

     Traffic Mode Type     Mandatory
     Routing Context       Optional
     INFO String           Optional

The format for the ASPAC message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |           Tag = 11            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Traffic Mode Type                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 6            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                       Routing Context*                        / 
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |          Tag = 4              |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


Traffic Mode Type: 32-bit (unsigned integer)

   The Traffic Mode Type parameter identifies the traffic mode of 
   operation of the ASP within an AS. The valid values for Type are 
   shown in the following table.

         1         Over-ride
         2         Load-share
         3         Over-ride (Standby)
         4         Load-share (Standby)






Sidebottom et al                                             [Page 55]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


   Within a particular Routing Context, only one Traffic Mode Type
   can be used.  The Over-ride value indicates that the ASP is 
   operating in Over-ride mode, and the ASP takes over all 
   traffic in an Application Server (i.e., primary/back-up operation), 
   over-riding any currently active ASPs in the AS.  In Load-share 
   mode, the ASP will share in the traffic distribution with any other 
   currently active ASPs.  The Standby versions of the Over-ride and 
   Load-share Types indicate that the ASP is declaring itself ready to 
   accept traffic but leaves it up to the sender as to when the traffic 
   is started.  Over-ride (Standby) indicates that the traffic sender 
   continues to use the currently active ASP until it can no longer 
   send/receive traffic (i.e., the currently active ASP transitions to 
   Down or Inactive).  At this point the sender MUST move the standby 
   ASP to Active and commence traffic.  Load-share (Standby) is similar 
   - the sender continues to load-share to the current ASPs until it is 
   determined that there is insufficient resources in 
   the Load-share group.  When there are insufficient ASPs, the sender 
   MUST move the ASP to Active.

Routing Context: n X 32-bit integers

   The optional Routing Context parameter contains (a list of) integers 
   indexing the Application Server traffic that the sending ASP is 
   configured/registered to receive.  

   There is one-to-one relationship between an index entry and an SG 
   Routing Key or AS Name.  Because an AS can only appear in one 
   Network Appearance, the Network Appearance parameter is not required 
   in the ASPAC message.

   An Application Server Process may be configured to process traffic 
   for more than one logical Application Server.  From the perspective 
   of an ASP, a Routing Context defines a range of signalling traffic 
   that the ASP is currently configured to receive from the SG.  For 
   example, an ASP could be configured to support call processing for 
   multiple ranges of PSTN trunks and therefore receive related 
   signalling traffic, identified by separate SS7 DPC/OPC/CIC_ranges. 

The format and description of the optional Info String parameter is the 
same as for the DUNA message (See Section 3.4.1.)


3.5.6 ASP Active Ack

The ASPAC Ack message is used to acknowledge an ASP-Active message 
received from a remote M3UA peer.  In the case where an ASPAC (Over-
ride (standby)) or ASPAC (load-share (standby) is received, a second 
ASPACK Ack is sent when the ASP is moved to the "Active" state from 
"Active (Standby)".



Sidebottom et al                                             [Page 56]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


The ASPAC Ack message contains the following parameters:

     Traffic Mode Type     Mandatory
     Routing Context       Optional
     INFO String           Optional

The format for the ASPAC Ack message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           Tag = 11            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Traffic Mode Type                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 6            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                       Routing Context*                        / 
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |            Tag = 4            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


The format and description of the optional Info String parameter is the 
same as for the DUNA message (See Section 3.3.2.1.)

The format of the Traffic Mode Type and Routing Context parameters is 
the same as for the ASP-Active message. (See Section 3.4.5).


3.5.7  ASP Inactive (ASPIA)

The ASPIA message is sent by an ASP to indicate to a remote M3UA peer 
that it is no longer an active ASP to be used from within a list of 
ASPs.  The ASPIA affects only the ASP state in the Routing Keys 
identified by the Routing Contexts, if present. 

The ASPIA message contains the following parameters:

     Routing Context         Optional
     INFO String             Optional





Sidebottom et al                                             [Page 57]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


The format for the ASPIA message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |            Tag = 6            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                       Routing Context*                        / 
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |            Tag = 4            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


The format and description of the optional Routing Context and Info 
String parameters is the same as for the ASPAC message (See Section 
3.5.5.)

3.5.8 ASP Inactive Ack

The ASPIA Ack message is used to acknowledge an ASP-Inactive message 
received from a remote M3UA peer.

The ASPIA Ack message contains the following parameters:

     Routing Context       Optional
     INFO String           Optional

The format for the ASPIA Ack message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |            Tag = 6            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                       Routing Context*                        / 
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |            Tag = 4            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


Sidebottom et al                                             [Page 58]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


The format and description of the optional Info String parameter is the 
same as for the DUNA message (See Section 3.4.1.)

The format of the Routing Context parameter is the same as for the ASP-
Inactive message. (See Section 3.5.7).


3.5.9 Heartbeat (BEAT)

The Heartbeat message is optionally used to ensure that the M3UA peers 
are still available to each other.  It is recommended for use when the 
M3UA runs over a transport layer other than the SCTP, which has its own 
heartbeat.

The BEAT message contains the following parameters:

     Heatbeat Data         Optional

The format for the BEAT message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |            Tag = 8            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                       Heartbeat Data *                        /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

The Heartbeat Data parameter contents are defined by the sending node.  
The Heartbeat Data could include, for example, a Heartbeat Sequence 
Number and/or Timestamp.  The receiver of a Heartbeat message does not 
process this field as it is only of significance to the sender.  The 
receiver MUST respond with a BEAT-Ack message.
  

3.5.10 Heartbeat Ack (Beat-Ack)

The Heartbeat Ack message is sent in response to a received Heartbeat 
message.  It includes all the parameters of the received Heartbeat 
message, without any change.










Sidebottom et al                                             [Page 59]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


3.6  Management Messages

3.6.1  Error (ERR)

The Error message is used to notify a peer of an error event associated 
with an incoming message.  For example, the message type might be 
unexpected given the current state, or a parameter value might be 
invalid.  

The ERR message contains the following parameters:

     Error Code                 Mandatory
     Diagnostic Information     Optional

The format for the ERR message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 12           |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                          Error Code                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 7            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                     Diagnostic Information*                   /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


Error Code: 32-bits (unsigned integer)

   The Error Code parameter indicates the reason for the Error Message. 
   The Error parameter value can be one of the following values:

     1      Invalid Version 
     2      Invalid Network Appearance 
     3      Unsupported Message Class
     4      Unsupported Message Type 
     5      Unsupported/Invalid Traffic Handling Mode 
     6      Unexpected Message
     7      Protocol Error
     8      Invalid Routing Context
     9      Invalid Stream Identifier
    10      Invalid Parameter Value 


The "Invalid Version" error is sent if a message was received with an 
invalid or unsupported version.  The Error message contains the 


Sidebottom et al                                             [Page 60]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


supported version in the Common header.  The Error message could 
optionally provide the supported version in the Diagnostic Information 
area.

The "Invalid Network Appearance" error is sent by a SG if an ASP sends 
a message with an invalid (unconfigured) Network Appearance value.

The "Unsupported Message Class" error is sent if a message with an 
unexpected or unsupported Message Class is received.

The "Unsupported Message Type" error is sent if a message with an 
unexpected or unsupported Message Type is received.

The "Unsupported/Invalid Traffic Handling Mode" error is sent by a SG 
if an ASP sends an ASP Active with an unsupported Traffic Handling Mode 
or a Traffic Handling mode that is inconsistent with the presently 
configured mode for the Application Server.  An example would be a case 
in which the SG did not support load-sharing.

The "Unexpected Message" error MAY be sent if a defined and recognized 
message is received that is not expected in the current state( in some 
cases the ASP may optionally silently discard the message and not send 
an Error).  For example, silent discard is used by an ASP if it 
received a Transfer message from an SG while it was in the Inactive 
state. 

The "Protocol Error" error is sent for any protocol anomaly(i.e., 
reception of a parameter that is syntactically correct but unexpected 
in the current situation.

The "Invalid Routing Context" error is sent by an SG if an Asp sends a 
message with an invalid (unconfigured) Routing Context value.

The "Invalid Stream Identifier" error is sent if a message was received 
on an unexpected SCTP stream (e.g., a MGMT message was received on a 
stream other than "0").

The " Invalid Parameter Value " error is sent if a message was received 
with an invalid parameter value (e.g., a DUPU message was received with 
a Mask value other than "0").

Diagnostic Information: variable length

   When included, the optional Diagnostic information can be any 
   information germane to the error condition, to assist in 
   identification of the error condition.  In the case of an Invalid 
   Network Appearance, Traffic Handling Mode, Routing Context or 
   Parameter Value, the Diagnostic information includes the received 
   parameter.  In the other cases, the Diagnostic information may be 
   the first 40 bytes of the offending message.


Sidebottom et al                                             [Page 61]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


Error messages are not generated in response to other Error messages.


3.6.2 Notify (NTFY)

The Notify message used to provide an autonomous indication of M3UA 
events to an M3UA peer.  

The NTFY message contains the following parameters:

     Status Type/ID              Mandatory
     Routing Context            Optional
     INFO String                Optional

The format for the NTFY message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |          Tag = 13             |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |        Status Type            |    Status Identification      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |          Tag = 6              |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                       Routing Context*                        / 
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |          Tag = 4              |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


Status Type: 16-bits (unsigned integer)

   The Status Type parameter identifies the type of the Notify message.  
   The following are the valid Status Type values:

         1     Application Server State Change (AS-StateChange)
         2     Other 

Status Information: 16-bits (unsigned integer)

   The Status Information parameter contains more detailed information 
   for the notification, based on the value of the Status Type.  



Sidebottom et al                                             [Page 62]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


   If the Status Type is AS_State_Change the following Status 
   Information values are used:

         1    reserved
         2    Application Server Inactive (AS-Inactive)
         3    Application Server Active (AS-Active)
         4    Application Server Pending (AS-Pending)

   These notifications are sent from an SG to an ASP upon a change in 
   status of a particular Application Server. The value reflects the 
   new state of the Application Server.

   If the Status Type is Other, then the following Status Information 
   values are defined:

         1    Insufficient ASP resources active in AS
         2    Alternate ASP Active

These notifications are not based on the SG reporting the state change 
of an ASP or AS.  In the Insufficent ASP Resources case, the SG is 
indicating to an "Inactive" ASP(s) in the AS that another ASP is 
required in order to handle the load of the AS (Load-sharing mode).  
For the Alternate ASP Active case, an ASP is informed when an alternate 
ASP transitions to the ASP-Active state in Over-ride mode.  

The format and description of the optional Routing Context and Info 
String parameters is the same as for the ASPAC message (See Section 
3.4.6.)


4.0 Procedures

The M3UA layer needs to respond to various local primitives it receives 
from other layers as well as the messages that it receives from the 
peer M3UA layer.  This section describes the M3UA procedures in 
response to these events.

4.1 Procedures to support the services of the M3UA layer

4.1.1 Receipt of primitives from the M3UA-User

On receiving an MTP-Transfer request primitive from an upper layer, or 
the nodal inter-working function at an SG, the M3UA layer sends a 
corresponding DATA message (see Section 3) to its M3UA peer.  The M3UA 
peer receiving the Data message sends an MTP-Transfer indication 
primitive to the upper layer.

The M3UA message distribution function (see Section 1.4.2.1) determines 
the Application Server (AS) based on comparing the information in the 
MTP-Transfer request primitive with a provisioned Routing Key. 


Sidebottom et al                                             [Page 63]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


>From the list of ASPs within the AS table, an Active ASP is selected 
and a DATA message is constructed and issued on the corresponding SCTP 
Association.  If more than one ASP is active (i.e., traffic is to be 
load-shared across all the active ASPs), one of the active ASPs from 
the list is selected.  The selection algorithm is implementation 
dependent but could, for example, be round-robin or based on, for 
example, the SLS or ISUP CIC.  The appropriate selection algorithm must 
be chosen carefully as it is dependent on application assumptions and 
understanding of the degree of state coordination between the active 
ASPs in the AS. 

In addition, the message needs to be sent on the appropriate SCTP 
stream, again taking care to meet the message sequencing needs of the 
signalling application. 

When there is no Routing Key match, or only a partial match, for an 
incoming SS7 message, a default treatment must be specified.  Possible 
solutions are to provide a default Application Server at the SG that 
directs all unallocated traffic to a (set of) default ASP(s), or to 
drop the message and provide a notification to management in an M-Error 
indication primitive.  The treatment of unallocated traffic is 
implementation dependent.

4.1.2 Receipt of primitives from the Layer Management

On receiving primitives from the local Layer Management, the M3UA layer 
will take the requested action and provide an appropriate  response 
primitive to Layer Management.

An M-SCTP ESTABLISH request from Layer Management at an ASP or IPSP 
will initiate the establishment of an SCTP association.  The M3UA layer 
will attempt to establish an SCTP association with the remote M3UA peer 
at by sending an SCTP-Associate primitive to the local SCTP layer.  

When an SCTP association has been successfully established, the SCTP 
will send an SCTP-Communication Up notification to the local M3UA 
layer.  At the SG or IPSP that initiated the request, the M3UA will 
send an M-SCTP ESTABLISH confirm to Layer Management when the 
association set-up is complete.  At the peer M3UA layer, an M-SCTP 
ESTABLISH indication is sent to Layer Management upon successful 
completion of an incoming SCTP association set-up.

An M-SCTP RELEASE request from Layer Management initates the tear-down 
of an SCTP association.  M3UA accomplishes a graceful shutdown of the 
SCTP association by sending a SHUTDOWN primitive to the SCTP layer.  

When the graceful shutdown of the SCTP association has been 
accomplished, the SCTP layer returns a SHUTDOWN COMPLETE notification 



Sidebottom et al                                             [Page 64]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


to the local M3UA Layer.  At the M3UA Layer that initiated the request, 
the M3UA will send an M-SCTP RELEASE confirm to Layer Management when 
the association teardown is complete.   At the peer M3UA Layer, an M-
SCTP RELEASE indication is sent to Layer Management upon successful 
tear-down of an SCTP association.

An M-SCTP STATUS request supports a Layer Management query of the local 
status of a particular SCTP association.  The M3UA simply maps the M-
SCTP STATUS request to a STATUS primitive to the SCTP.  When the SCTP 
responds, the M3UA maps the association status information to an M-SCTP 
STATUS confirm.  No peer protocol is invoked.

Similar LM-to-M3UA-to-SCTP and/or SCTP-to-M3UA-LM mappings can be 
described for the various other SCTP Upper layer primitives in RFC2960 
such as Initialize, Set Primary, Change Heartbeat, Request Heartbeat, 
Get SRTT Report, Set Failure Threshold, Set Protocol parameters, 
Destroy SCTP Instance, Send Failure, and Network Status Change.  
Alternatively, these SCTP Upper Layer primitives (and Status as well) 
can be considered for modeling purposes as a Layer Management 
interaction directly with the SCTP Layer.  

M-NOTIFY indication and M-ERROR indication primitives indicate to Layer 
Management the notification or error information contained in a 
received M3UA Notify or Error message respectively.  These indications 
can also be generated based on local M3UA events.

An M-ASP STATUS request supports a Layer Management query of the status 
of a particular local or remote ASP.  The M3UA responds with the status 
in an M-ASP STATUS confirm.  No M3UA peer protocol is invoked.
 
An M-AS STATUS request supports a Layer Management query of the status 
of a particular AS.  The M3UA responds with an M-AS STATUS confirm.  No 
M3UA peer protocol is invoked.

M-ASP-UP request, M-ASP-DOWN request, M-ASP-ACTIVE request and M-ASP-
INACTIVE request primitives allow Layer Management at an ASP to 
initiate state changes.  Upon successful completion, a corresponding 
confirm is provided by the M3UA to Layer Management.  If an invocation 
is unsuccessful, an Error indication is provided.

These requests result in outgoing M3UA ASP-UP, ASP-DOWN, ASP-ACTIVE and 
ASP-INACTIVE messages to the remote M3UA peer at an SG or IPSP. 


4.2 Receipt of M3UA Peer Management messages

Upon successful state changes resulting from reception of M3UA ASP-UP, 
ASP-DOWN, ASP-ACTIVE and ASP-INACTIVE messages from a peer M3UA, the 




Sidebottom et al                                             [Page 65]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


M3UA layer MUST invoke corresponding M-ASP UP, M-ASP DOWN, M-ASP ACTIVE 
and M-ASP INACTIVE, M-AS ACTIVE, M-AS INACTIVE, and M-AS DOWN 
indications to the local Layer Management.

M-NOTIFY indication and M-ERROR indication indicate to Layer Management 
the notification or error information contained in a received M3UA 
Notify or Error message.  These indications can also be generated based 
on local M3UA events.


4.3 Procedures to support the M3UA Management services

These procedures support the M3UA management of SCTP Associations 
between SGs and ASPs.

4.3.1 AS and ASP State Maintenance

The M3UA layer on the SG maintains the state of each remote ASP, in 
each Application Server that the ASP is configured to receive traffic, 
as input to the M3UA message distribution function.  Similarly, where 
IPSPs use M3UA in a point-to-point fashion, the M3UA layer in an IPSP 
maintains the state of remote IPSPs. For the purposes of the following 
procedures, only the SG/ASP case is described but the SG side of the 
procedures also apply to an IPSP sending traffic to an AS consisting of 
a set of remote IPSPs.


4.3.1.1 ASP States

The state of each remote ASP, in each AS that it is configured to 
operate, is maintained in the M3UA layer in the SG. The state of a 
particular ASP in a particular AS changes due to events. The events 
include:

   * Reception of messages from the peer M3UA layer at the ASP;
   * Reception of some messages from the peer M3UA layer at other ASPs  
     in the AS (e.g., ASPAC Take-over);
   * Reception of indications from the SCTP layer; or
   * Local Management intervention.

The ASP state transition diagram is shown in Figure 4.  The possible 
states of an ASP are:

ASP-DOWN: The remote M3UA peer at the ASP is unavailable and/or the 
related SCTP association is down.  Initially all ASPs will be in this 
state.  An ASP in this state should not be sent any M3UA messages.

ASP-INACTIVE: The remote M3UA peer at the ASP is available (and the 
related SCTP association is up) but application traffic is stopped.  In 
this state the ASP can be sent any non-Data M3UA messages.


Sidebottom et al                                             [Page 66]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


ASP-ACTIVE: The remote M3UA peer at the ASP is available and 
application traffic is active (for a particular Routing Context or set 
of Routing Contexts).

ASP-STANDBY: The remote M3UA peer at the ASP is available and ready to 
receive application traffic at any time (for a particular Routing 
Context or set of Routing Contexts).  In this state the ASP can be sent 
any non-Data M3UA messages.


                 Figure 4: ASP State Transition Diagram

                                   +--------------+ 
                                   |  ASP-ACTIVE  |
            +----------------------|      or      |
            |    Alternate +-------| ASP-STANDBY* |
            |       ASP    |       +--------------+
            |     Takeover |           ^     |
            |              |    ASP    |     | ASP
            |              |    Active |     | Inact
            |              |           |     v
            |              |       +--------------+
            |              |       |              |
            |              +------>| ASP-INACTIVE |
            |                      +--------------+
            |                          ^     |
  ASP Down/ |                     ASP  |     | ASP Down /
  SCTP CDI  |                     Up   |     | SCTP CDI
            |                          |     v
            |                      +--------------+
            |                      |              |
            +--------------------->|   ASP-DOWN   |
                                   |              |
                                   +--------------+


*Note: ASP-ACTIVE and ASP-STANDBY differ only in whether the ASP is 
currently receiving Data traffic within the AS.

SCTP CDI: The local SCTP layer's Communication Down Indication to the 
Upper Layer Protocol (M3UA) on an SG. The local SCTP will send this 
indication when it detects the loss of connectivity to the ASP's peer 
SCTP layer.  SCTP CDI is understood as either a SHUTDOWN COMPLETE 
notification or COMMUNICATION LOST notification from the SCTP.

4.3.1.2  AS States

The state of the AS is maintained in the M3UA layer on the SG.

The state of an AS changes due to events. These events include:


Sidebottom et al                                             [Page 67]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


   * ASP state transitions
   * Recovery timer triggers

The possible states of an AS are:

AS-DOWN: The Application Server is unavailable.  This state implies 
that all related ASPs are in the ASP-DOWN state for this AS. Initially 
the AS will be in this state.

AS-INACTIVE: The Application Server is available but no application 
traffic is active (i.e., one or more related ASPs are in the ASP-
Inactive state, but none in the ASP-Active state).  The recovery timer 
T(r) is not running or has expired.

AS-ACTIVE: The Application Server is available and application traffic 
is active.  This state implies that at least one ASP is in the ASP-
ACTIVE state.

AS-PENDING: An active ASP has transitioned to inactive and it was the 
last remaining active ASP in the AS (and no STANDBY ASPs are available. 
A recovery timer T(r) will be started and all incoming SCN messages 
will be queued by the SG. If an ASP becomes active before T(r) expires, 
the AS will move to AS-ACTIVE state and all the queued messages will be 
sent to the active ASP. 

If T(r) expires before an ASP becomes active, the SG stops queuing 
messages and discards all previously queued messages. The AS will move 
to AS-INACTIVE if at least one ASP is in ASP-INACTIVE state, otherwise 
it will move to AS-DOWN state.























Sidebottom et al                                             [Page 68]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


                 Figure 5: AS State Transition Diagram

      +----------+   one ASP trans to ACTIVE   +-------------+
      |          |---------------------------->|             |      
      | AS-INACT |                             |  AS-ACTIVE  |
      |          |<---                         |             |
      +----------+    \                        +-------------+
         ^   |         \ Tr Expiry,                ^    |
         |   |          \ at least one             |    |
         |   |           \ ASP in INACT            |    |
         |   |            \                        |    |
         |   |             \                       |    |
         |   |              \                      |    |
 one ASP |   | all ASP       \            one ASP  |    | Last ACT ASP
 trans   |   | trans to       \           trans to |    | trans to 
INACT
 to INACT|   | DOWN            -------\   ACTIVE   |    | or DOWN
         |   |                         \           |    | 
         |   |                          \          |    |
         |   |                           \         |    |
         |   |                            \        |    |
         |   v                             \       |    v         
      +----------+                          \  +-------------+
      |          |                           --|             |      
      | AS-DOWN  |                             | AS-PENDING  |
      |          |                             |  (queueing) |
      |          |<----------------------------|             |
      +----------+       Tr Expiry no ASP      +-------------+
                         in INACT state

    Tr = Recovery Timer


4.3.2 M3UA Management procedures for primitives

Before the establishment of an SCTP association the ASP state at both 
the SG and ASP is assumed to be "Down".  

Once the SCTP association is established (See Section 4.1.2) and 
assuming that the local M3UA-User is ready, the local ASP M3UA 
Application Server Process Maintenance (ASPM) function will initiate 
the ASPM procedures, using the ASP-Up/-Down/-Active/-Inactive messages 
to convey the ASP-state to the SG - see Section 4.3.3. 

If the M3UA layer subsequently receives an SCTP-Communication Down 
indication from the underlying SCTP layer, it will inform the Layer 
Management by invoking the M-SCTP STATUS indication primitive. The 
state of the remote ASP will be moved to "Down".  At an ASP, the MTP3-
User at an ASP will be informed of the unavailability of any affected 
SS7 destinations through the use of MTP-PAUSE primitives.  In the case 


Sidebottom et al                                             [Page 69]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


of SS7 network isolation, the local MTP3-Users may be informed by 
implementation-dependent means as there is currently no primitive 
defined for conveying this information.

At an ASP, the Layer Management may try to re-establish the SCTP 
association using M-SCTP ESTABLISH request primitive. 

4.3.3 M3UA Management procedures for peer-to-peer messages

All M3UA MGMT and ASP Maintenance messages are sent on a sequenced 
stream to ensure ordering.  SCTP stream '0' is used.

4.3.3.1 ASP-Up

After an ASP has successfully established an SCTP association to an SG, 
the SG waits for the ASP to send an ASP-Up message, indicating that the 
ASP M3UA peer is available.  The ASP is always the initiator of the 
ASP-Up exchange.  This action MAY be initiated at the ASP by an M-ASP 
UP request primitive from Layer Management or may be initiated 
automatically by an M3UA management function.

When an ASP-Up message is received at an SG and internally the remote 
ASP is in the "Down" state and not considered locked-out for local 
management reasons, the SG marks the remote ASP as "Inactive" and 
informs Layer Management with an M-ASP-Up indication primitive.  If the 
SG knows, via current configuration data, which Application Servers the 
ASP is configured to operate in, it can update the ASP status to 
"Inactive" in each AS that it is a member.  Alternatively, the SG may 
move the ASP into a pool of Inactive ASPs available for future 
activation in Application Server(s) denoted in the subsequent ASP-
Active Routing Contexts.  The SG responds with an ASP-Up Ack message in 
acknowledgement.  The SG sends an ASP-Up Ack message in response to a 
received ASP-Up message even if the ASP is already marked as "Inactive" 
at the SG.  

If for any local reason (e.g., management lock-out) the SG cannot 
respond with an ASP-Up Ack, the SG responds to an ASP-Up with an ASP-
Down Ack message with Reason "Management Blocking".  

At the ASP, the ASP-Up Ack message received is not acknowledged. Layer 
Management is informed with an M-ASP UP confirm primitive .

When the ASP sends an ASP-Up message it starts timer T(ack).  If the 
ASP does not receive a response to an ASP-Up within T(ack), the ASP MAY 
restart T(ack) and resend ASP-Up messages until it receives an ASP-Up 
Ack message.  T(ack) is provisionable, with a default of 2 seconds.  
Alternatively, retransmission of ASP-Up messages may be put under 
control of Layer Management.  In this method, expiry of T(ack) results 
in a M-ASP-Up confirmation carrying a negative indication.  



Sidebottom et al                                             [Page 70]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


The ASP must wait for the ASP-Up Ack message before sending any other 
M3UA messages (e.g., ASPAC, REG REQ).  If the SG receives any other 
M3UA messages before an ASP Up is received, the SG should discard them.

If an ASP-Up is received and internally the remote ASP is in the 
"Active" or "Standby" state, an Error ("Unexpected Message) is returned 
and the remote ASP state is not changed.

If an ASP-Up is received and internally the remote ASP is already in 
the "Inactive" state, and ASP-Up Ack is returned and no action is 
taken.

4.3.3.2 ASP-Down

The ASP will send an ASP-Down to an SG when the ASP wishes to be 
removed from service in all Application Servers that it is a member and 
no longer receive any M3UA traffic or management messages.  This action 
MAY be initiated at the ASP by an M-ASP DOWN request primitive from 
Layer Management or may be initiated automatically by an M3UA 
management function.   

Whether the ASP is permanently removed from any AS is a function of 
configuration management.

The SG marks the ASP as "Down", informs Layer Management with an M-ASP-
Down indication primitive, and returns an ASP-Down Ack message to the 
ASP if one of the following events occur:

    - an ASP-Down message is received from the ASP,
    - another ASPM message is received from the ASP and the SG has  
      locked out the ASP for management reasons.

The SG sends an ASP-Down Ack message in response to a received ASP-Down 
message from the ASP even if the ASP is already marked as "Down" at the 
SG.  

At the ASP, the ASP-Down Ack message received is not acknowledged. 
Layer Management is informed with an M-ASP Down confirm primitive.

When the ASP sends an ASP-Down it starts timer T(ack).  If the ASP does 
not receive a response to an ASP-Down within T(ack), the ASP MAY 
restart T(ack) and resend ASP-Down messages  until it receives an ASP-
Down Ack message.  T(ack) is provisionable, with a default of 2 
seconds.  Alternatively, retransmission of ASP-Down messages may be put 
under control of Layer Management.  In this method, expiry of T(ack) 
results in a M-ASP-Down confirmation carrying a negative indication. 






Sidebottom et al                                             [Page 71]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


4.3.3.3 M3UA Version Control

If an ASP-Up message with an unsupported version is received, the 
receiving end responds with an Error message, indicating the version 
the receiving node supports and notifies Layer Management.

This is useful when protocol version upgrades are being performed in a 
network.  A node upgraded to a newer version should support the older 
versions used on other nodes it is communicating with.  Because ASPs 
initiate the ASP-Up procedure it is assumed that the Error message 
would normally come from the SG.

4.3.3.4 ASP-Active

Anytime after the ASP has received an ASP-Up Ack from the SG or IPSP, 
the ASP sends an ASP-Active (ASPAC) to the SG indicating that the ASP 
is ready to start processing traffic.  This action MAY be initiated at 
the ASP by an M-ASP Active request primitive from Layer Management or 
may be initiated automatically by an M3UA management function.   In the 
case where an ASP wishes to process the traffic for more than one 
Application Server across a common SCTP association, the ASPAC contains 
a list of one or more Routing Contexts to indicate for which 
Application Servers the ASPAC applies. It is not necessary for the ASP 
to include all Routing Contexts of interest in the initial ASPAC 
message, thus becoming active in all Routing Contexts at the same time.    
Multiple ASPAC messages MAY be used to activate within the Application 
Servers independently.  In the case where an ASP-Active message does 
not contain a Routing Context parameter, the receiver must know, via 
configuration data, which Application Server(s) the ASP is a member.

When an ASP Active (ASPAC) message is received, the SG or IPSP responds 
with an ASPAC Ack message(with the same Type value contained in the 
received APAC), acknowledging that the ASPAC was received and, 
depending on the ASPAC Type value, moves the ASP to the "Active" or 
"Standby" state within the associated Application Server(s). Layer 
Management is informed with an ASP-Active indication primitive. If the 
SG or IPSP receives any Data messages before an ASPAC is received, the 
SG or IPSP should discard them.  By sending an ASPAC Ack, the SG or 
IPSP is now ready to receive and send traffic for the related Routing 
Contexts.  The ASP MUST not send Data messages before receiving an 
ASPAC Ack.

Multiple ASPAC Ack messages MAY be used in response to an ASPAC 
containing multiple Routing Contexts, allowing the SG or IPSP to 
independently Ack for different (sets of) Routing Contexts.  The SG or 
IPSP sends an Error ("Invalid Routing Context") message for each 
invalid or un-configured Routing Context value in a received ASPAC 
message. 

 


Sidebottom et al                                             [Page 72]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


The SG MUST send an ASP-Active Ack message in response to a received 
ASP-Active message from the ASP and the ASP is already marked as 
"Active" at the SG.  

At the ASP, the ASP-Active Ack message received is not acknowledged. 
Layer Management is informed with an M-ASP Active confirm primitive.

When the ASP sends an ASP-Active it starts timer T(ack).  If the ASP 
does not receive a response to an ASP-Active within T(ack), the ASP MAY 
restart T(ack) and resend ASP-Active messages until it receives an ASP-
Active Ack message.  T(ack) is provisionable, with a default of 2 
seconds.  Alternatively, retransmission of ASP-Active messages may be 
put under control of Layer Management.  In this method, expiry of 
T(ack) results in a M-ASP-Active confirmation carrying a negative 
indication.  

There are four modes of Application Server traffic handling in the SG 
M3UA - Over-ride, Over-ride (Standby), Loadshare and Load-share 
(Standby).  The Traffic Mode Type parameter in the ASPAC message 
indicates the traffic handling mode used in a particular Application 
Server. If the SG determines that the mode indicated in an ASPAC is 
unsupported or incompatible with the mode currently configured for the 
AS, the SG responds with an Error message indicating "Unsupported / 
Invalid Traffic Handling Mode".  If the Traffic Handling mode of the 
Application Server is not already known via configuration data, then 
the Traffic handling mode indicated in the first ASPAC message causing 
the transition of the Application Server state to "Active" MAY be used 
to set the mode.

In the case of an Over-ride mode AS, reception of an ASPAC message at 
an SG causes the redirection of all traffic for the AS to the ASP that 
sent the ASPAC.  Any previously active ASP in the AS is now considered 
Inactive and will no longer receive traffic from the SG within the AS.  
The SG or IPSP sends a Notify (Alternate ASP-Active) to the previously 
active ASP in the AS, after stopping all traffic to that ASP.  

In the case of Over-ride (Standby) mode the traffic is not started to 
the ASP until the previously active ASP transitions to "Inactive or 
"Down" state.  At this point the ASP that sent the Over-Ride (Standby) 
ASPAC is moved to the Active state and the traffic is redirected.  A 
second ASP-Active Ack message with a new Traffic Mode Type ("Over-
ride", previously "Over-ride(Standby)") is sent to the ASP. A Notify 
(Alternate ASP-Active) message is not sent in this case.

In the case of a Load-share mode AS, reception of an ASPAC message at 
an SG or IPSP causes the direction of traffic to the ASP sending the 
ASPAC, in addition to all the other ASPs that are currently active in 
the AS.  The algorithm at the SG for load-sharing traffic within an AS 




Sidebottom et al                                             [Page 73]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


to all the active ASPs is implementation dependent.  The algorithm 
could, for example be round-robin or based on information in the Data 
message (e.g., such as the SLS, SCCP SSN, ISUP CIC value).  

An SG or IPSP, upon reception of an ASPAC for the first ASP in a 
Loadshare AS, MAY choose not to direct traffic to a newly active ASP 
until it determines that there are sufficient resources to handle the 
expected load (e.g., until there are sufficient ASPs "Active" in the 
AS).

In the case of Load-share (Standby) mode, the traffic is not started to 
the ASP until the SG or IPSP determines that there are insufficient 
resources available in the AS.  This is likely when one of the active 
load-sharing ASPs transitions to the "Inactive" or "Down" state.  At 
this point the ASP that sent the Load-share (Standby) ASPAC is moved to 
the Active state and traffic is started.  A second ASP-Active Ack 
message with a new Traffic Mode Type ("Load-share" - previously 
"Loadshare(Standby)") is sent to the ASP. A Notify ("Insufficient ASP 
resources active in AS ") message is not sent in this case.

All ASPs within a load-sharing mode AS must be able to handle any 
traffic within the AS, in order to accommodate any potential fail-over 
or rebalancing of the offered load.

4.3.3.5 ASP Inactive

When an ASP wishes to withdraw from receiving traffic within an AS, the 
ASP sends an ASP Inactive (ASPIA) to the SG or IPSP.  This action MAY 
be initiated at the ASP by an M-ASP INACTIVE request primitive from 
Layer Management or may be initiated automatically by an M3UA 
management function.   In the case where an ASP is processing the 
traffic for more than one Application Server across a common SCTP 
association, the ASPIA contains one or more Routing Contexts to 
indicate for which Application Servers the ASPIA applies.  In the case 
where an ASP-Inactive message does not contain a Routing Context 
parameter, the receiver must know, via configuration data, which 
Application Servers the ASP is a member and move the ASP to the 
"Inactive" state in each AS.

In the case of an Over-ride mode AS, where another ASP has already 
taken over the traffic within the AS with an Over-ride ASPAC, the ASP 
that sends the ASPIA is already considered by the SG to be "Inactive".  
An ASPIA Ack message is sent to the ASP, after ensuring that all 
traffic is stopped to the ASP. 

In the case of a Load-share mode AS, the SG moves the ASP to the 
"Inactive" state and the AS traffic is re-allocated across the 
remaining "active" ASPs per the load-sharing algorithm currently used
within the AS.  A NTFY(Insufficient ASP resources active in AS) may be 
sent to all inactive ASPs, if required.  However, if a Loadshare


Sidebottom et al                                             [Page 74]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


(Standby) ASP is available, it may be now immediately included in the 
loadshare group and a Notify message is not sent.  An ASPIA Ack message 
is sent to the ASP after all traffic is halted and Layer Management is 
informed with an ASP-INACTIVE indication primitive.

Multiple ASPIA Ack messages MAY be used in response to an ASPIA 
containing multiple Routing Contexts, allowing the SG or IPSP to 
independently Ack for different (sets of) Routing Contexts.  The SG or 
IPSP sends an Error ("Invalid Routing Context") message for each 
invalid or un-configured Routing Context value in a received ASPIA 
message.

The SG MUST send an ASP-Inactive Ack message in response to a received 
ASP-Inactive message from the ASP and the ASP is already marked as 
"Inactive" at the SG.  

At the ASP, the ASP-INACTIVE Ack message received is not acknowledged. 
Layer Management is informed with an M-ASP INACTIVE confirm primitive.  
When the ASP sends an ASP-Inactive it starts timer T(ack).  If the ASP 
does not receive a response to an ASP-Inactive within T(ack), the ASP 
MAY restart T(ack) and resend ASP-Inactive messages  until it receives 
an ASP-Inactive Ack message.  T(ack) is provisionable, with a default 
of 2 seconds.  Alternatively, retransmission of ASP-Inactive messages 
may be put under control of Layer Management.  In this method, expiry 
of T(ack) results in a M-ASP-Inactive confirmation carrying a negative 
indication.  

If no other ASPs are "Active" or "Standby" in the Application Server, 
the SG sends a NTFY(AS-Pending) to all inactive ASPs of the AS and 
either discards all incoming messages for the AS or starts buffering 
the incoming messages for T(r)seconds, after which messages will be 
discarded.  T(r) is configurable by the network operator.  If the SG 
receives an ASPAC from an ASP in the AS before expiry of T(r), the 
buffered traffic is directed to the ASP and the timer is cancelled.  If 
T(r) expires, the AS is moved to the "Inactive" state.

4.3.3.6 Notify

A Notify message reflecting a change in the AS state is sent to all 
ASPs in the AS, except those in the "Down" state, with appropriate 
Status Identification.  At the ASP, Layer Management is informed with 
an M-NOTIFY indication primitive.

In the case where a Notify (AS-Pending) message is sent by an SG that 
now has no ASPs active to service the traffic, or a NTFY(Insufficient 
ASP resources active in AS) is sent in the Loadshare mode, the Notify 
does not explicitly compel the ASP(s) receiving the message to become 
active. The ASPs remain in control of what (and when) traffic action is 
taken.



Sidebottom et al                                             [Page 75]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


4.3.3.7 Heartbeat

The optional Heartbeat procedures may be used when operating over 
transport layers that do not have their own heartbeat mechanism for 
detecting loss of the transport association (i.e., other than the 
SCTP).  

After receiving an ASP-Up Ack message from an M3UA peer in response to 
an ASP-Up message, an ASP may optionally send Beat messages 
periodically, subject to a provisionable timer T(beat).  Upon receiving 
a BEAT message, the M3UA peer MUST respond with a BEAT ACK message.  If 
no BEAT ACK message (or any other M3UA message), is received by the ASP 
within the timer 2*T(beat), the ASP will consider the remote M3UA peer 
as "Down".

At the ASP, if no BEAT ACK message (or any other M3UA message) is 
received from the M3UA peer within 2*T(beat), the remote M3UA peer is 
considered unavailable.  Transmission of BEAT messages is stopped and 
ASP-Up procedures are used to re-establish communication with the SG 
M3UA peer.

The BEAT message may optionally contain an opaque Heartbeat Data 
parameter that MUST be echoed back unchanged in the related Beat Ack 
message.  The ASP upon examining the contents of the returned BEAT Ack 
message MAY choose to consider the remote ASP as unavailable. The 
contents/format of the Heartbeat Data parameter is implementation-
dependent and only of local interest to the original sender.  The 
contents may be used, for example, to support a Heartbeat sequence 
algorithm (to detect missing Heartbeats), and/or a timestamp mechanism 
(to evaluate delays).

Note: Heartbeat related events are not shown in Figure 4 "ASP state 
transition diagram".  

4.3.4 Routing Key Management procedures

4.3.4.1 Registration

An ASP MAY dynamically register with an SG as an ASP within an 
Application Server using the REG REQ message. A Routing Key parameter 
in the REG REQ specifies the parameters associated with the Routing 
Key.  

The SG examines the contents of the received Routing Key parameter and 
compares it with the currently provisioned Routing Keys.  If the 
received Routing Key matches an existing SG Routing Key entry, and the 
ASP is not currently included in the list of ASPs for the related 
Application Server, the ASP MAY authorize the ASP to be added to the 
AS.  Or, if the Routing Key does not currently exist and the received 
Routing Key data is valid and unique, an SG supporting dynamic 


Sidebottom et al                                             [Page 76]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


configuration MAY authorize the creation of a new Routing Key and 
related Application Server and add the ASP to the new AS.  In either 
case, the SG returns a Registration Response message to the ASP, 
containing the same Local-RK-Identifier as provided in the initial 
request, and a Registration Result "Successfully Registered".  A unique 
Routing Context value assigned to the SG Routing Key is included. The 
method of Routing Context value assignment at the SG/SGP is 
implementation dependent but must be guaranteed to be unique across all 
SGPs in an SG.

If the SG determines that the received Routing Key data is invalid, or 
contains invalid parameter values, the SG returns a Registration 
Response message to the ASP, containing a Registration Result "Error - 
Invalid Routing Key", "Error - Invalid DPC, "Error - Invalid Network 
Appearance" as appropriate.

If the SG determines that the Routing Key parameter overlaps with an 
existing Routing Key entry, the SG returns a Registration Response 
message to the ASP, with a Registration Status of "Error - Overlapping 
(Non-Unique) Routing Key".  An incoming signalling message received at 
an SG cannot match against more than one Routing Key.

If the SG does not authorize the registration request, the SG returns a 
REG RSP message to the ASP containing the Registration Result "Error û 
Permission Denied".

If an SG determines that a received Routing Key does not currently 
exist and the SG does not support dynamic configuration, the SG returns 
a Registration Response message to the ASP, containing a Registration 
Result "Error - Routing Key not Provisioned".

If an SG determines that a received Routing Key does not currently 
exist and the SG supports dynamic configuration but does not have the 
capacity to add new Routing Key and Application Server entries, the SG 
returns a Registration Response message to the ASP, containing a 
Registration Result "Error - Insufficient Resources".

An ASP MAY register multiple Routing Keys at once by including a number 
of Routing Key parameters in a single REG REQ message.  The SG MAY 
respond to each registration request in a single REG RSP message, 
indicating the success or failure result for each Routing Key in a 
separate Registration Result parameter.  Alternatively the SG MAY 
respond with multiple REG RSP messages, each with one or more 
Registration Result parameters.  The ASP uses the Local-RK-Identifier 
parameter to correlate the requests with the responses.

Upon successful registration of an ASP in an AS, the SG can now send 
related SSNM messaging, if this did not previously start upon the ASP 
transitioning to "Inactive".



Sidebottom et al                                             [Page 77]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001



4.3.4.2 Deregistration

An ASP MAY dynamically deregister with an SG as an ASP within an 
Application Server using the DEREG REQ message. A Routing Context 
parameter in the DEREG REQ specifies which Routing Key to de-register.  

The SG examines the contents of the received Routing Context parameter 
and validates that the ASP is currently registered in the Application 
Server(s) related to the included Routing Context(s).  If validated, 
the ASP is de-registered as an ASP in the related Application Server.  

The deregistration procedure does not necessarily imply the deletion of
Routing Key and Application Server configuration data at the SG. Other 
ASPs may continue to be associated with the Application Server, in 
which case the Routing Key data CANNOT be deleted.  If a Deregistration 
results in no more ASPs in an Application Server, an SG MAY delete the 
Routing Key data.

The SG acknowledges the de-registration request by returning a DEREG 
RSP to the requesting ASP.  The result of the de-registration is found 
in the Deregistration Result parameter, indicating success or failure 
with cause.

An ASP MAY deregister multiple Routing Contexts at once by including a 
number of Routing Contexts in a single DEREG REQ message.  The SG MUST 
respond to each deregistration request in a single DEREG RSP message, 
indicating the success or failure result for each Routing Context in a 
separate Deregistration Result parameter.  


4.4 Procedures to support the M3UA services

4.4.1 At an SG

On receiving an MTP-PAUSE, MTP-RESUME, or MTP-STATUS indication 
primitive from the nodal inter-working function at an SG, the SG M3UA 
layer will send a corresponding SSNM DUNA, DAVA, SCON, or DUPU message 
(see Section 2) to the M3UA peers at concerned ASPs.  The M3UA layer 
must fill in various fields of the SSNM messages consistently with the 
information received in the primitives.  

The SG M3UA determines the set of concerned ASPs to be informed based 
on the SS7 network partition for which the primitive indication is 
relevant. In this way, all ASPs configured to send/receive traffic 
within a particular network appearance are informed.  If the SG 
operates within a single SS7 network appearance, then all ASPs are 
informed.  




Sidebottom et al                                             [Page 78]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


Optionally, the SG M3UA may filter further based on the Affected Point 
Code in the MTP-PAUSE, MTP-Resume, or MTP-Status indication primitives.  
In this way ASPs can be informed only of affected destinations to which 
they actually communicate.  The SG M3UA may also suppress DUPU messages 
to ASPs that do not implement an MTP3-User protocol peer for the 
affected MTP3-User.

DUNA, DAVA, SCON messages must be sent on a sequenced stream as these 
primitives should arrive in order.  Stream 0 is used.  Sequencing is 
not required for the DUPU or DAUD message, which may optionally be sent 
un-sequenced.  The same applies for the SCON message if the 
international congestion method (see Q.704) is used.

4.4.2 At an ASP

4.4.2.1 Single SG configurations

At an ASP, upon receiving an SSNM message from the remote M3UA Peer, 
the M3UA layer invokes the appropriate primitive indications to the 
resident M3UA-Users.  Local management is informed.

In the case where a local event has caused the unavailability or 
congestion status of SS7 destinations, the M3UA at the ASP should pass 
up appropriate indications n the primitives to the M3UA User, as though 
equivalent SSNM messages were received.  For example, the loss of an 
SCTP association to an SG may cause the unavailability of a set of SS7 
destinations.  MTP-Pause indications to the M3UA User is appropriate.  
To accomplish this, the M3UA layer at an ASP maintains the status of 
routes via the SG, much like an MTP3 layer maintains route-set status.

4.4.2.2 Multiple SG configurations

At an ASP, upon receiving an SSNM message from the remote M3UA Peer, 
the M3UA layer updates the status of the affected route(s) via the 
originating SG and determines, whether or not the overall availability 
or congestion status of the effected destination(s) has changed. In 
this case the M3UA layer invokes the appropriate primitive indications 
to the resident M3UA-Users.  Local management is informed.

4.4.3 ASP Auditing

An ASP may optionally initiate an audit procedure in order to enquire 
of an SG the availability and, if the congestion method with multiple 
congestion levels and message priorities is used, congestion status of 
an SS7 destination or set of destinations.  A Destination Audit (DAUD) 
message is sent from the ASP to the SG requesting the current 
availability and congestion status of one or more SS7 Destination Point 
Codes.




Sidebottom et al                                             [Page 79]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001

 
The DAUD may be sent un-sequenced. The DAUD may be sent by the ASP in 
the following cases:  

   - Periodic.  A Timer originally set upon reception of DUNA or SCON 
     message has expired without a subsequent DAVA, DUNA or SCON  
     updating the availability/congestion status of the affected  
 
     Destination Point Codes.  The Timer is reset upon issuing a DAUD.   
     In this case the DAUD is sent to the SG that originally sent the  
     SSNM message.
 
   - the ASP is newly "Inactive" or "Active" or has been isolated from 
     an SG for an extended period.  The ASP can request the 
     availability/congestion status of one or more SS7 destinations to  
     which it expects to communicate.

In the first case, the DAUD procedure must not be invoked for the case 
of  received SCON containing a congestion level value of "no 
congestion" or undefined" (i.e., congestion Level = "0").  This is 
because the value indicates either congestion abatement or that the ITU 
MTP3 international congestion method is being used.  In the 
international congestion method, the MTP3 at the SG MTP3 does not 
maintain the congestion status of any destinations and therefore the SG 
cannot provide any congestion information in response to the DAUD.  For 
the same reason, in the second case a DAUD cannot reveal any congested 
destination(s).

The SG MUST respond to a DAUD with the MTP3 status of the routeset 
associated with each Destination Point Code(s) in the DAUD.  The status 
of each SS7 destination requested is indicated in a DUNA (if 
unavailable), DAVA (if available/uncongested) or an SCON (if 
available/congested).  Optionally, any DUNA or DAVA message in response 
to a DAUD may contain a list of up to sixteen Affected Point Codes. 
Note that from the point of view of an ASP sending an DAUD, the 
subsequent reception of an SCON implies that the Affected Destination 
is available.  The reception of a DAVA implies that the routeset to the 
Affected Destination is not congested.  Obviously with the reception of 
an DUNA, the routeset to the Affected Destination can not also be 
congested.













Sidebottom et al                                             [Page 80]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


5.0 Examples of M3UA Procedures

5.1 Establishment of Association and Traffic between SGs and ASPs

5.1.1a Single ASP in an Application Server ("1+0" sparing), No 
Registration

This scenario shows the example M3UA message flows for the 
establishment of traffic between an SG and an ASP, where only one ASP 
is configured within an AS (no backup).  It is assumed that the SCTP 
association is already set-up. The sending of DUNA/SCON messages by the 
SG is not shown but would be similar to 5.1.2.

             SG                              ASP1
              |                                |
              |<-------------ASP Up------------|
              |-----------ASP-Up Ack---------->|
              |                                | 
              |<------- ASP Active(RCn)--------|  RC: Routing Context 
              |-----ASP Active Ack (RCn)------>|      (optional)
              |                                |

Note: If ASPAC contains an optional Routing Context parameter, The 
ASPAC only applies for the specified RC value. For an unknown RC value, 
the SG responds with an Error message.


5.1.1b Single ASP in Application Server ("1+0" sparing), With Dynamic 
Registration

This scenario is the same as for 5.1.1a but with the optional exchange 
of registration information.  In this case the Registration is accepted 
by the SG.



















Sidebottom et al                                             [Page 81]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


             SG                              ASP1
              |                                |
              |<------------ASP Up-------------| 
              |----------ASP-Up Ack----------->|
              |                                |
              |<----REGISTER REQ(LRCn,RKn)-----|  LRC: Local Routing                             
              |                                |       Context            
              |----REGISTER RESP(LRCn,RCn)---->|   RK: Routing Key        
              |                                |   RC: Routing Context    
              |                                | 
              |<------- ASP Active(RCn)--------| 
              |-----ASP Active Ack (RCn)------>|
              |                                |

Note: In the case of an unsuccessful registration attempt (e.g., 
Invalid RKn), the Register Response will contain an unsuccessful 
indication and the ASP will not subsequently send an ASPAC.  


5.1.1c Single ASP in multiple Application Servers (each with "1+0" 
sparing), With Dynamic Registration (Case 1 û Multiple Registration 
Requests)

             SG                              ASP1
              |                                |
              |<------------ASP Up-------------| 
              |----------ASP-Up Ack----------->|
              |                                |
              |<----REGISTER REQ(LRC1,RK1)-----|  LRC: Local Routing                             
              |                                |       Context            
              |----REGISTER RESP(LRC1,RC1)---->|   RK: Routing Key        
              |                                |   RC: Routing Context    
              |                                | 
              |<------- ASP Active(RC1)--------| 
              |-----ASP Active Ack (RC1)------>|
              |                                |
              :                                :
              :                                :
              |                                |
              |<----REGISTER REQ(LRCn,RKn)-----|
              |                                |
              |----REGISTER RESP(LRCn,RCn)---->|
              |                                |
              |                                | 
              |<------- ASP Active(RCn)--------| 
              |-----ASP Active Ack (RCn)------>|
              |                                |





Sidebottom et al                                             [Page 82]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


Note: In the case of an unsuccessful registration attempt (e.g., 
Invalid RKn), the Register Response will contain an unsuccessful 
indication and the ASP will not subsequently send an ASPAC. Each LRC/RK 
pair registration is considered independently. 

It is not necessary to follow a Registration Request/Response with an 
ASP Active before sending the next Registration Request. The ASP Active 
can happen any time after the related successful Registration. 


5.1.1.d Single ASP in multiple Application Servers (each with "1+0" 
sparing), With Dynamic Registration (Case 2 û Single Registration 
Request)


             SG                              ASP1
              |                                |
              |<------------ASP Up-------------| 
              |----------ASP-Up Ack----------->|
              |                                |
              |<---REGISTER REQ({LRC1,RK1},----| 
              |                   ...,         |
              |                 {LRCn,RKn}),----|
              |                                |
              |---REGISTER RESP({LRC1,RC1},--->|   
              |                  ...,          |
              |                 (LRCn,RCn})    |   
              |                                | 
              |<------- ASP Active(RC1)--------| 
              |-----ASP Active Ack (RC1)------>|
              |                                |
              :                                :
              :                                :
              |                                | 
              |<------- ASP Active(RCn)--------| 
              |-----ASP Active Ack (RCn)------>|
              |                                |

Note: In the case of an unsuccessful registration attempt (e.g., 
Invalid RKn), the Register Response will contain an unsuccessful 
indication and the ASP will not subsequently send an ASPAC. Each LRC/RK 
pair registration is considered independently. 

The ASP Active can happen any time after the related successful 
Registration, and may have more than one RC.




     


Sidebottom et al                                             [Page 83]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


5.1.2 Two ASPs in Application Server ("1+1" sparing)

This scenario shows the example M3UA message flows for the 
establishment of traffic between an SG and two ASPs in the same 
Application Server, where ASP1 is configured to be "active" and ASP2 a 
"standby" in the event of communication failure or the withdrawal from 
service of ASP1.  ASP2 may act as a hot, warm, or cold standby 
depending on the extent to which ASP1 and ASP2 share call/transaction 
state or can communicate call state under failure/withdrawal events.  
The example message flow is the same whether the ASP-Active messages 
are Over-ride or Load-share mode although typically this example would 
use an Over-ride mode. In the case of MTP Restart, the SG starts 
sending any relevant DUNA and SCON messages to the ASPs as soon as they 
enter the ASP-INACTIVE state. The ASP-Active Ack message is only sent 
after all relevant DUNA/SCON messages have been transmitted to the 
concerned ASP.


       SG                        ASP1                        ASP2
        |                         |                          |
        |<--------ASP Up----------|                          | 
        |-------ASP-Up Ack------->|                          |
        |                         |                          |
        |<-----------------------------ASP Up----------------|
        |-----------------------------ASP-Up Ack------------>|
        |                         |                          | 
        |                         |                          |
        |<-------ASP Active-------|                          | 
        |------ASP-Active Ack---->|                          | 
        |                         |                          |


5.1.3 Two ASPs in an Application Server ("1+1" sparing, load-sharing 
case)

This scenario shows a similar case to Section 4.1.2 but where the two 
ASPs are brought to "active" and load-share the traffic load.  In this 
case, one ASP is sufficient to handle the total traffic load. The 
sending of DUNA/SCON messages by the SG is not shown but would be 
similar to 5.1.2.












Sidebottom et al                                             [Page 84]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


       SG                       ASP1                       ASP2
        |                         |                          |
        |<---------ASP Up---------|                          | 
        |--------ASP-Up Ack------>|                          |
        |                         |                          |
        |<------------------------------ASP Up---------------|
        |-----------------------------ASP Up Ack------------>|
        |                         |                          | 
        |                         |                          |
        |<--ASP Active (Ldshr)----|                          | 
        |-----ASP-Active Ack----->|                          | 
        |                         |                          |
        |<----------------------------ASP Active (Ldshr)-----| 
        |-------------------------------ASP-Active Ack------>| 
        |                         |                          |


5.1.4 Three ASPs in an Application Server ("n+k" sparing, load-sharing 
case) 

This scenario shows the example M3UA message flows for the 
establishment of traffic between an SG and three ASPs in the same 
Application Server, where two of the ASPs are brought to "active" and 
share the load. In this case, a minimum of two ASPs are required to 
handle the total traffic load (2+1 sparing). The sending of DUNA/SCON 
messages by the SG is not shown but would be similar to 5.1.2.


   SG                  ASP1                 ASP2                 ASP3 
    |                    |                   |                   |
    |<------ASP Up-------|                   |                   | 
    |-----ASP-Up Ack---->|                   |                   |
    |                    |                   |                   |
    |<--------------------------ASP Up-------|                   |
    |-------------------------ASP-Up Ack)--->|                   |
    |                    |                   |                   |
    |<---------------------------------------------ASP Up--------|
    |---------------------------------------------ASP-Up Ack---->|
    |                    |                   |                   | 
    |                    |                   |                   |
    |<--ASP Act (Ldshr)--|                   |                   | 
    |----ASP-Act Ack---->|                   |                   | 
    |                    |                   |                   |
    |<--------------------ASP Act. (Ldshr)---|                   | 
    |-----------------------ASP-Act Ack----->|                   | 
    |                    |                   |                   |






Sidebottom et al                                             [Page 85]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


5.2 ASP Traffic Fail-over Examples

5.2.1 (1+1 Sparing, withdrawal of ASP, Back-up Over-ride) 

Following on from the example in Section 5.1.2, and ASP1 withdraws from 
service:

       SG                       ASP1                       ASP2 
        |                         |                          |
        |<-----ASP Inactive-------|                          |
        |----ASP Inactive Ack---->|                          |
        |------------------------NTFY(AS-Pending)----------->| 
        |                         |                          | 
        |<------------------------------ ASP Active----------| 
        |------------------------------ASP-Active Ack)------>| 
        |                                                    |

Note: If the SG detects loss of the M3UA peer (M3UA heartbeat loss or 
detection of SCTP failure), the initial SG-ASP1 ASP Inactive message 
exchange would not occur.


5.2.2 (1+1 Sparing, Back-up Over-ride)

Following on from the example in Section 5.1.2, and ASP2 wishes to 
over-ride ASP1 and take over the traffic:

       SG                       ASP1                       ASP2 
        |                         |                          | 
        |<------------------------------ ASP Active----------| 
        |-------------------------------ASP-Active Ack------>|
        |----NTFY(Alt ASP-Act)--->| 
        |                         |                          | 


5.2.3 (n+k Sparing, Load-sharing case, withdrawal of ASP)

Following on from the example in Section 5.1.4, and ASP1 withdraws from 
service:

   SG                  ASP1                 ASP2                 ASP3 
    |                    |                   |                   |
    |<----ASP Inact.-----|                   |                   | 
    |---ASP-Inact Ack--->|                   |                   |
    |                    |                   |                   | 
    |---------------------------------NTFY(Ins. ASPs)----------->| 
    |                    |                   |                   |
    |<-----------------------------------------ASP Act (Ldshr)---| 
    |-------------------------------------------ASP Act (Ack)--->|
    |                    |                   |                   |


Sidebottom et al                                             [Page 86]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


For the Notify to occur the SG maintains knowledge of the minimum ASP 
resources required - for example if the SG knows that "n+k" = "2+1" for 
a load-share AS and "n" currently equals "1". 

Note: If the SG detects loss of the ASP1 M3UA peer (M3UA heartbeat loss 
or detection of SCTP failure), the first SG-ASP1 ASP Inactive message 
exchange would not occur.  


5.3  M3UA/MTP3-User Boundary Examples

5.3.1 At an ASP

This section describes the primitive mapping from the MTP3 User to M3UA 
at an ASP.  

5.3.1.1 Support for MTP-Transfer on the ASP

5.3.1.1.1 Support for MTP-Transfer Request
When the MTP3-User on the ASP has data to send into the SS7 network, it 
will use the MTP-Transfer Request primitive.  The M3UA on the ASP will 
do the following when it receives an MTP-Transfer Request primitive 
from the M3UA user:

  - Determine the correct SG

  - Determine the correct association to the chosen SG

  - Determine the correct stream in the association (e.g., based on  
    SLS)

  - Determine whether to complete the optional fields of the Data  
    message

  - Map the MTP-Transfer Request primitive into the Protocol Data  
    field of an m3ua Data message

  - Send the Data message to the remote M3UA peer in the SG, over the  
    SCTP association

        SG                       ASP   
        |                         |                  
        |<-----Data Message-------|<--MTP-Transfer req. 
        |                         | 

        
5.3.1.1.2 Support for MTP Transfer Indication

When the M3UA on the ASP has received Data messages from the remote 
M3UA peer in the SG it will do the following:
   
          
Sidebottom et al                                             [Page 87]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


  - Evaluate the optional fields of the Data message if present

  - Map the Payload of a Data message into the MTP-Transfer Indication  
    primitive

  - Pass the MTP-Transfer Indication primitive to the user part. In  
    case of multiple user parts, the optional fields of the Data
    message are used to determine the concerned user part.

        SG                       ASP   
        |                         |
        |------Data Message------>|-->MTP-Transfer ind.
        |                         |          

5.3.1.1.3 Support for ASP Querying of SS7 Destination States

There are situations such as temporary loss of connectivity to the SG 
that may cause the M3UA on the ASP to audit SS7 destination 
availability states.  Note: there is no primitive for the MTP3-User to 
request this audit from the M3UA as this is initiated by an internal 
M3UA management function.  

The M3UA on the ASP normally sends Destination State Audit (DAUD) 
messages for each of the destinations that the ASP supports.

       SG                        ASP   
        |                         |                  
        |<-----DAUD Message ------| 
        |<-----DAUD Message ------| 
        |<-----DAUD Message ------| 
        |                         |                     
        |                         |             

5.3.2 At an SG 

This section describes the MTP3 upper layer primitive mapping to the 
M3UA at the SG.

5.3.2.1 Support for MTP-Transfer Request at the SG

When the M3UA on the SG has received Data messages from its peer 
destined to the SS7 network it will do the following:

  - Evaluate the optional fields of the Data message if present to  
    determine the network appearance

  - Map the Protocol data of the Data message into an MTP-Transfer  
    Request primitive

  - Pass the MTP-Transfer Request primitive to the MTP3 of the  
    concerned network appearance.

Sidebottom et al                                             [Page 88]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


                            SG                        ASP
                             |                         |
        <---MTP-Transfer req.|<------Data Message------|
                             |                         |


5.3.2.2 Support for MTP-Transfer Indication at the SG

When the MTP3 on the SG has data to pass its user parts, it will use 
the MTP-Transfer Indication primitive.  The M3UA on the SG will do the 
following when it receives an MTP-Transfer Indication:

  - Determine the correct ASP

  - Determine the correct association to the chosen ASP

  - Determine the correct stream in the association (e.g., based on  
    SLS)

  - Determine whether to complete the optional fields of the Data  
    message

  - Map the MTP-Transfer Indication primitive into the Protocol Data  
    field of an M3UA Data message

  - Send the Data message to the remote M3UA peer in the ASP, over the  
    SCTP association 

                           SG                        ASP
                            |                         |
       --MTP-Transfer ind.->|------Data Message------>|
                            |                         |


5.3.2.3 Support for MTP-PAUSE, MTP-RESUME, MTP-STATUS

The MTP-PAUSE, MTP-RESUME and MTP-STATUS indication primitives from the 
MTP3 upper layer interface at the SG need to be made available to the 
remote MTP3 User Part lower layer interface at the concerned ASP(s).

5.3.2.3.1 Destination Unavailable 

The MTP3 on the SG will generate an MTP-PAUSE primitive when it 
determines locally that an SS7 destination is unreachable.  The M3UA 
will map this primitive to a Destination Unavailable (DUNA) message.  
The SG M3UA determines the set of concerned ASPs to be informed based 
on internal SS7 network information associated with the MTP-PAUSE 
primitive indication.




Sidebottom et al                                             [Page 89]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


                   SG                       ASP   
                    |                         |
 --MTP-PAUSE ind.-->|------DUNA Message ----->|--MTP-PAUSE ind.-->
                    |                         |


5.3.2.3.2 Destination Available

The MTP3 on the SG will generate an MTP-RESUME primitive when it 
determines locally that an SS7 destination that was previously 
unreachable is now reachable.  The M3UA will map this primitive to a 
Destination Available (DAVA) message.  The SG M3UA determines the set 
of concerned ASPs to be informed based on internal SS7 network 
information associated with the MTP-RESUME primitive indication.

                   SG                       ASP   
                    |                         |
--MTP-RESUME ind.-->|------DAVA Message ----->|--MTP-RESUME ind.-->
                    |                         |


5.3.2.3.3 SS7 Network Congestion 

The MTP3 on the SG will generate an MTP-STATUS primitive when it 
determines locally that the route to an SS7 destination is congested.  
The M3UA will map this primitive to a SS7 Network Congestion State 
(SCON) message.  It will determine which ASP(s) to send the DUPU to 
based on the intended Application Server.
 
                     SG                       ASP   
                       |                         |                  
   --MTP-STATUS ind.-->|------SCON Message ----->|--MTP-STATUS ind.--> 
                       |                         |

5.3.2.3.4 Destination User Part Unavailable

The MTP3 on the SG will generate an MTP-STATUS primitive when it 
receives an UPU message from the SS7 network.  The M3UA will map this 
primitive to a Destination User Part Unavailable (DUPU) message.  It 
will determine which ASP(s) to send the DUPU based on the intended 
Application Server.

                      SG                       ASP   
                       |                         |                  
   --MTP-STATUS ind.-->|------DUPU Message ----->|--MTP-STATUS ind.--> 
                       |                         | 






Sidebottom et al                                             [Page 90]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


6.0 Security

6.1 Introduction

M3UA is designed to carry signalling messages for telephony services. 
As such, M3UA must involve the security needs of several parties: the 
end users of the services; the network providers and the applications 
involved.  Additional requirements may come from local regulation.  
While having some overlapping security needs, any security solution 
should fulfill all of the different parties' needs. 

6.2 Threats

There is no quick fix, one-size-fits-all solution for security.  As a 
transport protocol, M3UA has the following security objectives:

 * Availability of reliable and timely user data transport.
 * Integrity of user data transport.
 * Confidentiality of user data.

M3UA runs on top of SCTP.  SCTP [6] provides certain transport related 
security features, such as some protection against:

 * Blind Denial of Service Attacks
 * Flooding
 * Masquerade
 * Improper Monopolization of Services

When M3UA is running in professionally managed corporate or service 
provider network, it is reasonable to expect that this network includes 
an appropriate security policy framework. The "Site Security Handbook" 
[21] should be consulted for guidance.

When the network in which M3UA runs in involves more than one party, it 
may not be reasonable to expect that all parties have implemented 
security in a sufficient manner.  In such a case, it is recommended 
that IPSEC is used to ensure confidentiality of user payload.  Consult 
[22] for more information on configuring IPSEC services.

6.3 Protecting Confidentiality 

Particularly for mobile users, the requirement for confidentiality may 
include the masking of IP addresses and ports.  In this case 
application level encryption is not sufficient; IPSEC ESP should be 
used instead.  Regardless of which level performs the encryption, the 
IPSEC ISAKMP service should be used for key management.






Sidebottom et al                                             [Page 91]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


7.0 IANA Considerations

7.1 SCTP Payload Protocol Identifier

A request will be made to IANA to assign an M3UA value for the Payload 
Protocol Identifier in SCTP Payload Data chunk.  The following SCTP 
Payload Protocol Identifier will be registered:

        M3UA    "3"

The SCTP Payload Protocol Identifier is included in each SCTP Data 
chunk, to indicate which protocol the SCTP is carrying. This Payload
Protocol Identifier is not directly used by SCTP but MAY be used by
certain network entities to identify the type of information being 
carried in a Data chunk.

The User Adaptation peer MAY use the Payload Protocol Identifier as a 
way of determining additional information about the data being 
presented to it by SCTP.

7.2 M3UA Protocol Extensions

This protocol may also be extended through IANA in three ways:
 -- through definition of additional message classes,
 -- through definition of additional message types, and 
 -- through definition of additional message parameters

The definition and use of new message classes, types and parameters is 
an integral part of SIGTRAN adaptation layers.  Thus these extensions 
are assigned by IANA through an IETF Consensus action as defined in 
[RFC2434].

The proposed extension must in no way adversely affect the general 
working of the protocol.

7.2.1 IETF Defined Message Classes

The documentation for a new message class MUST include the following 
information:
(a) A long and short name for the new message class;
(b) A detailed description of the purpose of the message class.

7.2.2 IETF Defined Message Types

The documentation for a new message type MUST include the following 
information:
(a) A long and short name for the new message type;
(b) A detailed description of the structure of the message. 
(c) A detailed definition and description of intended use for each 
    field within the message. 


Sidebottom et al                                             [Page 92]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001
 

(d) A detailed procedural description of the use of the new message 
    type within the operation of the protocol. 
(e) A detailed description of error conditions when receiving this 
    message type. 

When an implementation receives a message type which it does not 
support, it MUST respond with an Error (ERR) message, with an Error 
Code = Unsupported Message Type.

7.2.3 IETF-defined TLV Parameter extension

Documentation of the message parameter MUST contain the following 
information:

(a) Name of the parameter type.
(b) Detailed description of the structure of the parameter field.  This 
    structure MUST conform to the general type-length-value format 
    described in Section 3.1.5.  
(c) Detailed definition of each component of the parameter value. 
(d) Detailed description of the intended use of this parameter type, 
    and an indication of whether and under what circumstances multiple 
    instances of this parameter type may be found within the same 
    message.


8.0 Acknowledgements

The authors would like to thank John Loughney, Neil Olson, Michael 
Tuexen, Nikhil Jain, Steve Lorusso, Dan Brendes, Joe Keller, Heinz 
Prantner, Barry Nagelberg, Naoto Makinae, Selvam Rengasami, Shyamal 
Prasad, Joyce Archibald, Ray Singh, Antonio Roque Alvarez and many 
others for their valuable comments and suggestions.


9.0  References

[1] RFC 2719, "Framework Architecture for Signaling Transport"

[2] ITU-T Recommendations Q.761 to Q.767, 'Signalling System No.7 (SS7)  
    - ISDN User Part (ISUP)'

[3] ANSI T1.113 - 'Signaling System Number 7 - ISDN User Part

[4] ETSI ETS 300 356-1 "Integrated Services Digital Network (ISDN);  
    Signalling System No.7; ISDN User Part (ISUP) version 2 for the  
    international interface; Part 1: Basic services"

[5] ITU-T Recommendations Q.711-715, 'Signalling System No. 7 (SS7) -  
    Signalling Connection Control Part (SCCP)'



Sidebottom et al                                             [Page 93]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001

 
[6] ANSI T1.112 'Signaling System Number 7 - Signaling Connection 
    Control Part'

[7] ETSI ETS 300 009-1, "Integrated Services Digital Network (ISDN);  
    Signalling System No.7; Signalling Connection Control Part (SCCP)  
    (connectionless and connection-oriented class 2) to support  
    international interconnection; Part 1: Protocol specification"

[8] ITU-T Recommendations Q.720, 'Telephone User Part'

[9] ITU-T Recommendation Q.771-775 'Signalling System No. 7 SS7) -  
    Transaction Capabilities (TCAP)

[10] ANSI T1.114 'Signaling System Number 7 - Transaction Capabilities 
     Application Part'

[11] ETSI ETS 300 287-1, "Integrated Services Digital Network (ISDN);  
     Signalling System No.7; Transaction Capabilities (TC) version 2; 
     Part 1: Protocol specification"

[12] 3G TS 25.410 V3.1.0 (2000-01) Technical Specification - 3rd  
     Generation partnership Project; Technical Specification Group  
     Radio Access Network; UTRAN Iu Interface: General Aspects and  
     Principles (3G TS 25.410 Version 3.1.0 Release 1999) 

[13] RFC 2960, "Stream Control Transport Protocol", R. Stewart et al, 
     October 2000. 
 
[14] ITU-T Recommendations Q.701-Q.705, 'Signalling System No. 7 (SS7)  
     - Message Transfer Part (MTP)'

[15] ANSI T1.111 'Signaling System Number 7 - Message Transfer Part'

[16] ETSI ETS 300 008-1, "Integrated Services Digital Network (ISDN);  
     Signalling System No.7; Message Transfer Part (MTP) to support  
     international interconnection; Part 1: Protocol specification"

[17] ITU-T Recommendation Q.2140 'B-ISDN ATM Adaptation Layer - Service 
     Specific Coordination Function for signalling at the Network Node  
     Interface (SSCF at NNI)

[18] ITU-T Recommendation Q.2110 'B-ISDN ATM Adaptation Layer - Service  
     Specific Connection Oriented Protocol (SSCOP)

[19] MTP2-User Adaptation Layer <draft-ietf-sigtran-m2ua-05.txt>, Nov.  
     2000, Work in Progress

[20] ITU-T Recommendation Q.2210 'B-ISDN MTP'




Sidebottom et al                                             [Page 94]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001
 

[21] RFC 2196, "Site Security Handbook", B. Fraser Ed., September 1997 

[22] RFC 2401, "Security Architecture for the Internet Protocol", S.
Kent, R. Atkinson, November 1998.


10.0  Author's Addresses

Greg Sidebottom
Nortel Networks
3685 Richmond Rd,
Nepean, Ontario, Canada  K2H 5B7
gregside@nortelnetworks.com

Guy Mousseau
Nortel Networks
3685 Richmond Rd
Nepean, Ontario, Canada  K2H 5B7

Lyndon Ong
Point Reyes Networks
1991 Concourse Dr.
San Jose, CA, USA  95131
long@pointreyesnet.com

Ian Rytina
Ericsson Australia
37/360 Elizabeth Street 
Melbourne, Victoria 3000, Australia
ian.rytina@ericsson.com

Hanns Juergen Schwarzbauer
SIEMENS AG
Hofmannstr. 51
81359 Munich, Germany
HannsJuergen.Schwarzbauer@icn.siemens.de

Klaus D. Gradischnig
SIEMENS AG
Hofmannstr. 51
81359 Munich, Germany
klaus.gradischnig@icn.siemens.de

Ken Morneault
Cisco Systems Inc.
13615 Dulles Technology Drive
Herndon, VA, USA  20171
EMail: kmorneau@cisco.com




Sidebottom et al                                             [Page 95]

Internet Draft       SS7 MTP3-User Adaptation Layer         Feb 2001


Malleswar Kalla
Telcordia Technologies
MCC 1J211R
445 South Street
Morristown, NJ, USA  07960
Email: kalla@research.telcordia.com

Normand Glaude
Performance Technologies
150 Metcalf Sreet, Suite 1300
Ottawa, Ontario, Canada  K2P 1P1
EMail: nglaude@microlegend.com




















This draft expires August 2001.



















Sidebottom et al                                             [Page 96]

